{"aback": 63, "abashed": 5, "abhor": 24, "abhorred": 8, "abhorrence": 10, "abhorrent": 63, "abominable": 174, "abound": 311, "absent": 568, "absorbed": 397, "acceptance": 413, "accepted": 972, "accepting": 358, "accommodating": 15, "accomplished": 787, "accordant": 0, "accursed": 10, "accusatory": 5, "accused": 775, "accusing": 83, "acerbic": 59, "acidic": 26, "active": 463, "acute": 50, "adamant": 58, "addled": 72, "admiration": 297, "admit": 3823, "adoration": 76, "adoring": 80, "adrift": 85, "adversarial": 9, "affability": 5, "affected": 696, "affectionate": 130, "afflicted": 91, "affronted": 6, "aflutter": 0, "afraid": 2019, "agape": 33, "aggravated": 42, "aggravation": 24, "aggression": 137, "aggressive": 388, "aggrieve": 0, "aggrieved": 14, "aghast": 70, "agitated": 51, "agog": 5, "agonized": 13, "agreeable": 85, "agressive": 4, "airhead": 70, "alarm": 240, "alarmed": 36, "alarming": 141, "alert": 509, "alerted": 27, "alienated": 154, "allergic": 80, "alleviated": 7, "alluring": 209, "aloof": 150, "amatory": 0, "amazed": 1156, "amazement": 132, "amazing": 7602, "ambition": 442, "ambitious": 870, "ambivalence": 48, "ambivalent": 68, "amenable": 7, "amiable": 183, "amicable": 12, "amused": 476, "amusement": 442, "analytical": 33, "analyzing": 86, "anger": 1124, "angered": 134, "angrily": 73, "angry": 2237, "angst": 532, "anguish": 257, "anguished": 64, "animated": 2716, "animosity": 53, "annoyance": 219, "annoyed": 829, "annoying": 6305, "antagonistic": 55, "antagonized": 2, "anticipated": 282, "anticipating": 123, "anticipation": 370, "anticipative": 0, "anticipatory": 12, "antipathy": 10, "antsy": 14, "anxiety": 238, "anxious": 279, "anxiously": 72, "apathetic": 129, "apathy": 104, "apologetic": 36, "appalled": 218, "appallingly": 146, "appeased": 10, "appeasing": 17, "appreciative": 88, "apprehension": 37, "apprehensive": 50, "approve": 154, "approved": 157, "approving": 21, "argue": 784, "argumentative": 20, "aroused": 132, "arrogance": 248, "arrogant": 672, "arrogantly": 27, "artificial": 528, "ashamed": 1053, "aspiring": 414, "assertive": 61, "assertively": 2, "assessing": 14, "assured": 394, "astonished": 180, "astonishment": 54, "astounded": 99, "attempting": 1101, "attentive": 62, "attentiveness": 2, "attracted": 801, "avenging": 101, "averse": 27, "aversion": 45, "aversive": 0, "avid": 379, "avoiding": 354, "awaiting": 270, "awakened": 97, "aware": 1775, "awareness": 313, "awe": 577, "awed": 66, "awestruck": 42, "awful": 11149, "awkward": 1610, "awkwardness": 140, "axed": 60, "backhanded": 12, "badly": 4138, "baffle": 28, "baffled": 208, "baffling": 205, "baked": 293, "banal": 468, "barking": 133, "bashful": 7, "beaming": 39, "bearish": 0, "beat": 2402, "beaten": 829, "bedeviled": 9, "befuddled": 114, "begging": 344, "begrudge": 13, "begrudging": 15, "begrudgingly": 27, "beguiled": 79, "belated": 47, "belittling": 20, "belligerence": 7, "belligerent": 51, "belonging": 148, "bemused": 129, "bemusement": 20, "benevolence": 9, "benevolent": 101, "benumbed": 4, "berate": 40, "berating": 23, "bereaved": 23, "bereft": 87, "beseeching": 1, "bested": 19, "betrayal": 500, "betrayed": 340, "bewildered": 159, "bewilderment": 70, "bi": 162, "bilious": 18, "bit": 19337, "biting": 419, "bitter": 1026, "bittersweet": 287, "blaming": 112, "bland": 1715, "blank": 668, "blase": 22, "blazed": 22, "bleak": 727, "bleary": 6, "blessed": 263, "blew": 589, "blinded": 149, "blindsided": 8, "bliss": 168, "blissful": 46, "blissfully": 63, "blithe": 26, "blown": 1208, "blue": 3109, "blues": 656, "bluffing": 14, "blunt": 391, "blushing": 22, "blustering": 33, "boastful": 12, "boggled": 11, "boiling": 127, "boisterous": 54, "bold": 604, "bored": 3462, "boredom": 894, "boring": 11905, "bothered": 1268, "bounder": 7, "brashness": 14, "bratty": 129, "brave": 1041, "bright": 1844, "bristling": 8, "broken": 1794, "brokenhearted": 3, "brokenheartedly": 0, "brooding": 370, "broody": 12, "bruised": 56, "brusque": 16, "bug": 611, "bulging": 73, "bully": 423, "bullying": 170, "bummed": 31, "buoyant": 33, "burdened": 74, "burn": 865, "bursting": 173, "bushed": 0, "cagey": 26, "cagy": 0, "calculating": 108, "callous": 131, "callused": 0, "calm": 660, "calming": 18, "calmness": 22, "canny": 34, "cantankerous": 50, "capable": 1556, "capricious": 32, "captivated": 288, "captive": 256, "carefree": 171, "careful": 590, "careless": 157, "caring": 977, "catty": 48, "caustic": 63, "cautionary": 120, "cautious": 99, "cavalier": 44, "celebrating": 164, "celebration": 358, "censure": 12, "centered": 684, "certain": 5153, "chafed": 5, "chagrin": 94, "chagrined": 7, "chagrinned": 0, "challenge": 1013, "challenged": 531, "challenging": 601, "chaotic": 312, "charged": 447, "charmed": 207, "charming": 2554, "chary": 0, "cheated": 591, "cheeky": 124, "cheered": 143, "cheerful": 253, "cheering": 296, "cheerless": 9, "cheery": 89, "cheesy": 4355, "chesty": 23, "chide": 10, "chiding": 2, "childish": 733, "childishly": 47, "childlike": 133, "chill": 298, "chilled": 30, "chilling": 960, "chipper": 48, "chirpy": 26, "choleric": 7, "chortling": 10, "chuckle": 479, "chuckling": 105, "churlish": 23, "circumspect": 11, "clamorous": 2, "clash": 354, "clear": 5317, "clenched": 31, "clever": 3718, "close": 7968, "closed": 698, "closemouthed": 0, "cloy": 1, "clueless": 518, "clutched": 4, "cluttered": 84, "cockeyed": 21, "cockiness": 23, "cocksure": 11, "cocky": 238, "cognizant": 14, "cold": 3428, "collected": 184, "collusive": 2, "colonized": 23, "combative": 19, "comedic": 2004, "comfort": 532, "comfortable": 714, "comforted": 25, "comical": 1081, "commanding": 268, "commiserating": 0, "commiserative": 0, "communicative": 15, "compassion": 485, "compassionate": 253, "competent": 880, "competitive": 142, "complacence": 2, "complacency": 43, "complacent": 57, "complacently": 1, "complain": 702, "complaining": 512, "composed": 652, "comprehending": 29, "compulsive": 178, "concealed": 83, "conceding": 7, "conceited": 67, "concentrated": 198, "concentrating": 137, "concentration": 273, "concern": 543, "concerned": 1676, "conciliatory": 1, "conclusive": 34, "condemning": 78, "condescending": 188, "condoling": 0, "confidence": 519, "confident": 449, "confidently": 50, "conflicted": 252, "confound": 18, "confounded": 28, "confrontational": 40, "confused": 2412, "confusion": 983, "congenial": 12, "congratulatory": 45, "conniving": 192, "conscious": 555, "conservative": 576, "considerate": 50, "considering": 3397, "consoling": 18, "conspiratorial": 14, "conspiring": 41, "consternation": 38, "constipated": 74, "constrained": 60, "consumed": 232, "consuming": 119, "contained": 694, "contemplate": 145, "contemplating": 161, "contemplation": 75, "contemplative": 96, "contempt": 318, "contemptuous": 26, "content": 2271, "contented": 17, "contentious": 22, "contently": 2, "contentment": 23, "contradictory": 87, "contrary": 685, "contrite": 23, "controlled": 544, "controlling": 299, "controversial": 932, "contumacious": 0, "convinced": 1203, "cool": 6676, "cooperative": 26, "cordial": 18, "courageous": 268, "covert": 123, "cowardly": 183, "coy": 98, "crabby": 20, "crafty": 101, "cranky": 111, "crazed": 521, "crazy": 3999, "credulous": 9, "creepy": 3781, "crestfallen": 6, "cringing": 194, "critical": 1190, "cross": 2298, "crotchety": 26, "crude": 1038, "cruel": 1279, "crushed": 258, "cry": 2269, "crying": 1268, "cryptic": 131, "culpable": 13, "cunning": 275, "curios": 14, "curiosity": 875, "curious": 1487, "cutting": 1462, "cynic": 115, "cynical": 1019, "cynicism": 249, "dalliance": 26, "dandy": 214, "dangerous": 1915, "darkly": 229, "daunted": 3, "daydream": 53, "daydreaming": 22, "dazed": 96, "dazzled": 56, "deadly": 1292, "deadpan": 285, "debate": 491, "debating": 99, "debauched": 13, "deceitful": 47, "deceived": 110, "deceiving": 65, "deceivingly": 7, "deception": 257, "deceptive": 125, "deciding": 328, "decisive": 57, "dedicated": 672, "defeat": 568, "defeated": 373, "defenseless": 61, "defensive": 53, "defiance": 77, "defiant": 101, "deflated": 39, "degage": 0, "degrading": 168, "dejected": 23, "dejection": 6, "deliberate": 360, "deliberating": 3, "delight": 990, "delighted": 318, "delightful": 1359, "delirious": 154, "delirium": 34, "delude": 22, "delusional": 201, "demanding": 443, "demeaning": 117, "demented": 453, "demised": 0, "demoralized": 11, "demure": 51, "denied": 257, "denouncing": 19, "depleted": 25, "deplorable": 154, "deprecating": 60, "depressed": 697, "depression": 745, "deprived": 138, "deranged": 522, "derision": 52, "derisive": 22, "derogatory": 53, "desire": 1614, "desiring": 51, "desirous": 18, "desolate": 216, "despair": 550, "despaired": 12, "despairing": 40, "desperate": 1859, "desperation": 550, "despise": 295, "despondent": 42, "destitute": 42, "destroyed": 1281, "detached": 260, "determination": 357, "determined": 1072, "determining": 41, "deterred": 24, "detest": 63, "detestable": 67, "detesting": 0, "detriment": 86, "devastated": 198, "deviant": 110, "devilish": 129, "devious": 185, "devising": 14, "diffident": 24, "dilatory": 5, "diligent": 25, "dimwitted": 82, "dire": 708, "disagree": 973, "disagreeable": 38, "disagreement": 56, "disappointed": 5658, "disappointing": 2598, "disappointment": 2383, "disapproval": 52, "disapproving": 56, "disbelief": 1047, "disbelieve": 25, "disbelieving": 37, "discerning": 93, "discombobulated": 17, "discomfited": 4, "discomfort": 111, "discomforted": 0, "disconcerted": 14, "disconnected": 236, "disconsolate": 5, "discontent": 51, "discontented": 11, "discounted": 33, "discouraged": 61, "discovery": 789, "discriminating": 39, "discussed": 325, "disdain": 184, "disdained": 4, "disdainful": 7, "disdainfully": 3, "disenchanted": 42, "disengaged": 25, "disgraced": 86, "disgruntled": 148, "disgruntlement": 0, "disgust": 416, "disgusted": 449, "disgustedly": 1, "disgusting": 1478, "disheartened": 11, "dishonest": 149, "disillusioned": 168, "disinclined": 2, "disingenuous": 66, "disinterest": 30, "disinterested": 103, "disjointed": 765, "dislike": 934, "disliked": 482, "disliking": 99, "dismal": 377, "disman": 0, "dismay": 129, "dismayed": 75, "dismissive": 33, "disobedient": 16, "disorderly": 8, "disoriented": 39, "dispair": 6, "disparaging": 23, "dispassionate": 45, "dispirited": 5, "dispiritedness": 2, "displeased": 37, "displeasure": 142, "disquiet": 3, "disquieted": 0, "disregard": 295, "disrespectful": 112, "disrupted": 50, "disruptive": 50, "dissatisfaction": 37, "dissatisfied": 80, "dissatisfy": 0, "dissecting": 39, "dissociated": 5, "dissonant": 8, "distain": 0, "distant": 726, "distaste": 66, "distasteful": 190, "distracted": 339, "distraught": 172, "distress": 316, "distressed": 84, "distressing": 84, "distrust": 71, "distrustful": 12, "distrusting": 6, "disturbed": 688, "diverted": 33, "dodgy": 312, "doleful": 8, "doltish": 8, "dominant": 159, "dominating": 117, "domineering": 114, "done": 19355, "doomed": 705, "dopey": 238, "doting": 58, "doubt": 4884, "doubter": 4, "doubtful": 140, "doubtfully": 10, "doubtfulness": 0, "doubting": 88, "dour": 110, "down": 23582, "downcast": 9, "downhearted": 4, "downheartedness": 0, "downtrodden": 86, "dozing": 50, "drained": 183, "dramatic": 4008, "drawn": 2416, "dread": 354, "dreadful": 1616, "dreading": 32, "dreaming": 240, "dreamy": 223, "dreary": 548, "driven": 1563, "drowsy": 12, "drugged": 277, "drunk": 1759, "drunkenness": 29, "dubiety": 3, "dubious": 393, "dubiously": 12, "dull": 5179, "dumb": 4005, "dumbfound": 3, "dumbfounded": 77, "dumbstruck": 16, "dumfounded": 1, "dupe": 46, "duplicitous": 72, "dysphoric": 1, "eager": 576, "eagerness": 59, "earnest": 330, "easy": 5188, "ebullient": 16, "ecstasy": 150, "ecstatic": 102, "ecstatically": 5, "edgy": 522, "eerie": 846, "effulgent": 0, "egoistic": 9, "egotistical": 138, "egregious": 82, "elated": 19, "elation": 26, "electrified": 28, "elusive": 209, "embarrassed": 993, "embarrassment": 572, "embittered": 98, "embody": 72, "emotional": 4154, "emotionless": 198, "empathetic": 65, "empathic": 14, "empathy": 455, "emptiness": 184, "empty": 1754, "enamored": 95, "enchanted": 232, "encouraged": 239, "encouragement": 58, "encouraging": 160, "endeared": 19, "endearing": 750, "enduring": 309, "energetic": 395, "energized": 23, "engaged": 772, "engrossed": 157, "engrossment": 2, "enigmatic": 300, "enjoy": 11122, "enjoying": 1095, "enjoyment": 841, "enlightened": 173, "enmity": 12, "ennui": 59, "enraged": 133, "enraging": 10, "enraptured": 39, "entertained": 1271, "enthralled": 203, "enthused": 31, "enthusiasm": 527, "enthusiastic": 356, "enticed": 34, "entranced": 104, "envious": 37, "envy": 246, "erotically": 37, "estranged": 330, "etched": 74, "euphoric": 11, "evaluating": 40, "evasive": 26, "evil": 8740, "evoke": 283, "exacerbated": 28, "exalted": 28, "examining": 123, "exasperate": 5, "exasperated": 64, "exasperation": 35, "excited": 1393, "excitedly": 26, "excitement": 1279, "exclamation": 61, "exclamatory": 1, "exhausted": 214, "exhaustion": 63, "exhaustive": 45, "exhilarated": 17, "exhilaration": 30, "exited": 66, "expectant": 31, "expectation": 358, "expecting": 3683, "explain": 2912, "explaining": 708, "exploitive": 104, "explosive": 379, "exposure": 476, "expressive": 241, "exuberant": 118, "exultant": 0, "exulted": 0, "eye": 4882, "eyed": 950, "faced": 1299, "facetious": 16, "failure": 1571, "faint": 292, "fair": 2980, "fake": 3221, "faking": 125, "falter": 25, "famished": 5, "fanatic": 280, "fanciful": 96, "fart": 323, "fascinated": 506, "fastidious": 26, "fatigue": 61, "fatigued": 19, "faultfinding": 0, "favorable": 150, "fawning": 54, "fazed": 4, "fear": 3293, "feared": 222, "fearful": 129, "fearing": 158, "fearless": 158, "fearsome": 75, "feckless": 36, "fed": 624, "feeble": 311, "feign": 21, "felicitous": 11, "ferocious": 122, "ferocity": 39, "festive": 25, "fidgety": 15, "fiendish": 53, "fierce": 280, "fiery": 233, "fighting": 3859, "fine": 8085, "finished": 1830, "firm": 500, "fishy": 49, "fixated": 59, "fixed": 279, "flabbergasted": 42, "flaming": 124, "flat": 3545, "flaunting": 34, "flighty": 61, "flippant": 50, "flipped": 117, "flirtation": 45, "flirtatious": 69, "flirty": 32, "floored": 71, "flummoxed": 6, "flustered": 33, "focus": 3181, "focused": 1106, "focusing": 588, "foiled": 48, "foolish": 414, "forbearing": 0, "forbidding": 49, "forced": 4448, "forceful": 84, "forfeited": 3, "forlorn": 69, "fortunate": 373, "forward": 4129, "foul": 712, "fractious": 5, "fragile": 293, "frantic": 312, "fraudulent": 50, "fraught": 66, "frazzled": 29, "freaked": 189, "frenzied": 94, "fretful": 5, "friendliness": 16, "friendly": 1040, "fright": 429, "frightened": 454, "frightening": 1192, "frigid": 77, "frisky": 31, "frolicker": 0, "frown": 52, "frowning": 23, "frozen": 478, "frumpy": 39, "frustrated": 768, "frustration": 551, "fulfilled": 175, "fumed": 0, "fuming": 23, "fun": 16910, "funny": 27806, "furious": 430, "furiously": 34, "furiousness": 0, "furrowed": 15, "furtive": 28, "fury": 484, "fussy": 64, "galled": 2, "galling": 25, "gasp": 228, "gasped": 32, "gasping": 75, "gay": 4853, "gazing": 82, "genial": 52, "gentle": 716, "genuine": 1785, "ghastly": 284, "giddy": 120, "giggle": 216, "giggling": 179, "glad": 2845, "gladdened": 0, "gladiola": 0, "gladness": 3, "gladsome": 0, "glare": 39, "glaring": 353, "glazed": 32, "glee": 131, "gleeful": 61, "gleefully": 148, "glib": 88, "gloating": 10, "gloom": 100, "gloomy": 315, "glowering": 23, "glowing": 423, "glum": 50, "gnarl": 0, "gobsmacked": 11, "good": 94668, "goofy": 1258, "gossipy": 25, "grandiose": 132, "grateful": 370, "gratified": 12, "grave": 1140, "great": 57103, "greedy": 497, "greeting": 85, "grief": 467, "grieved": 15, "grieving": 176, "grim": 906, "grimace": 49, "grimacing": 32, "grin": 245, "grinning": 136, "griping": 18, "gross": 1141, "grossed": 90, "grouchy": 36, "growl": 49, "growling": 84, "grudge": 473, "grudging": 20, "gruff": 193, "grumbling": 22, "grumpy": 182, "grunt": 64, "grunting": 57, "guarded": 132, "guilty": 1286, "gulp": 34, "haggard": 165, "halfhearted": 16, "halted": 22, "hapless": 393, "happiness": 928, "happy": 5838, "harassed": 126, "hard": 17301, "hardened": 255, "harmful": 101, "harried": 65, "harsh": 1212, "hate": 5426, "hateful": 263, "hating": 330, "hatred": 734, "haughty": 82, "haunted": 1343, "hazy": 83, "headshake": 0, "heartache": 63, "heartbroken": 87, "hearted": 1308, "heartsick": 2, "heated": 129, "heavyhearted": 0, "heckle": 25, "heedful": 0, "heinous": 115, "helpful": 406, "helpless": 420, "hesitant": 151, "hesitantly": 13, "hesitating": 17, "hesitation": 158, "high": 14069, "hollering": 13, "homicidal": 246, "honest": 3125, "honorable": 204, "hope": 9482, "hopeful": 286, "hopefulness": 13, "hopeless": 538, "hoping": 2633, "horny": 448, "horrible": 8482, "horrified": 331, "horrify": 12, "horrifying": 549, "horror": 23667, "hostile": 320, "hostility": 104, "hot": 4384, "hotshot": 57, "huffiness": 0, "huffy": 5, "humble": 520, "humbled": 22, "humdrum": 75, "humiliated": 157, "humility": 92, "humming": 109, "humor": 8867, "humored": 36, "humorous": 1639, "hunger": 195, "hungry": 555, "hunted": 323, "hurt": 2351, "hurtful": 33, "hurting": 189, "hush": 113, "hushed": 32, "hyper": 295, "hyperactive": 86, "hypnotized": 97, "hypocritical": 168, "hysteria": 181, "hysterical": 818, "idiotic": 1026, "ignorant": 578, "ignoring": 331, "ill": 1791, "imaginative": 841, "immature": 421, "immersed": 155, "impacted": 63, "impartial": 40, "impassioned": 66, "impassive": 12, "impatience": 24, "impatient": 118, "imperious": 33, "impersonal": 52, "impertinent": 4, "impish": 18, "implicated": 41, "imploring": 5, "important": 6110, "impressed": 2242, "impulsive": 79, "inactive": 11, "inadequate": 143, "inarticulate": 49, "inattentive": 12, "inaudible": 61, "inauthentic": 32, "incapable": 320, "incensed": 29, "incertain": 0, "incertitude": 4, "incited": 6, "incomprehensible": 523, "inconspicuous": 19, "incredulity": 32, "incredulous": 87, "incredulously": 17, "inculpate": 2, "incurious": 2, "indecipherable": 44, "indecision": 24, "indecisive": 36, "indifferent": 310, "indifferently": 20, "indignant": 53, "indolent": 15, "inebriated": 44, "inert": 68, "infatuating": 0, "inferior": 538, "inferiority": 47, "inflamed": 9, "informal": 27, "informing": 88, "infuriated": 40, "inhibited": 11, "inhibiting": 8, "inimical": 0, "injured": 476, "innocent": 2671, "inpatient": 1, "inquiring": 24, "inquisitive": 36, "insane": 1616, "inscrutable": 54, "insecure": 220, "insecurity": 84, "insensitive": 146, "insidious": 61, "insinuating": 30, "insistence": 130, "insistent": 54, "insisting": 93, "insolent": 20, "insouciance": 15, "insouciant": 4, "inspired": 2304, "inspiring": 789, "instigating": 6, "instructing": 18, "insubordinate": 12, "insular": 43, "insulted": 298, "insulting": 806, "intelligence": 1989, "intense": 2165, "intensely": 321, "intensity": 881, "intensive": 58, "intent": 778, "intentional": 408, "interacting": 147, "interest": 6486, "interested": 4190, "interjecting": 2, "internalizing": 4, "interrogating": 37, "interrupting": 52, "intimidated": 60, "intimidating": 182, "intolerant": 45, "intoxicated": 73, "intrigue": 682, "intrigued": 679, "intriguing": 1981, "introspective": 116, "invested": 295, "investigate": 754, "investigative": 93, "investigatory": 4, "invigorated": 12, "involved": 6815, "irascible": 40, "irate": 38, "ire": 41, "ireful": 0, "irked": 53, "ironic": 958, "irony": 886, "irresolute": 5, "irritable": 43, "irritably": 6, "irritated": 274, "irritation": 138, "isolated": 735, "jabbed": 8, "jaded": 406, "jarred": 30, "jarring": 417, "jaunty": 44, "jawed": 115, "jealous": 732, "jeering": 13, "jesting": 0, "jilted": 72, "jittery": 52, "jocular": 6, "joking": 216, "jolly": 192, "jolted": 15, "jovial": 56, "joy": 1773, "joyful": 100, "joyfulness": 4, "joyless": 50, "joyous": 145, "jubilant": 18, "jubilation": 14, "judgemental": 32, "judging": 650, "judgmental": 88, "judicious": 38, "jumpy": 140, "justified": 364, "keen": 426, "kind": 17891, "kindhearted": 14, "kiss": 1199, "knowing": 2731, "knowledgable": 4, "knowledgeable": 121, "kosher": 21, "lackadaisical": 34, "lackluster": 481, "laconic": 85, "lambaste": 10, "lamentable": 48, "lamenting": 35, "lascivious": 59, "laugh": 9611, "laughing": 3698, "laughter": 1410, "lazy": 988, "leaving": 3049, "lecherous": 119, "lecturing": 42, "leering": 104, "leery": 32, "letdown": 300, "lethargic": 129, "levelheaded": 6, "lewd": 67, "libidinous": 30, "lifeless": 456, "lighthearted": 258, "lipped": 62, "listening": 1089, "listless": 108, "lively": 485, "livid": 8, "loaded": 533, "loath": 28, "loathe": 107, "loathing": 190, "loathsome": 125, "locked": 894, "loneliness": 507, "lonely": 1136, "longing": 359, "looking": 16423, "loony": 201, "loss": 1753, "lost": 9559, "loud": 2682, "lousy": 1451, "love": 40875, "loving": 1955, "lowliness": 1, "lurid": 228, "lustful": 74, "lusting": 70, "lusty": 71, "lying": 919, "mad": 3145, "maddened": 9, "madness": 1000, "malcontent": 9, "maleficent": 8, "malevolent": 155, "malice": 64, "malicious": 118, "malignant": 28, "maniacal": 170, "manipulative": 501, "marveled": 25, "master": 3152, "mean": 10821, "meaningful": 865, "meditative": 58, "meek": 178, "melancholic": 99, "melancholy": 282, "mellow": 76, "menace": 657, "menacing": 745, "mental": 1782, "merrily": 41, "merry": 260, "mesmerized": 148, "miffed": 24, "mild": 801, "mincing": 40, "mindful": 19, "mindless": 1051, "mirrored": 76, "mirth": 42, "mirthful": 14, "misanthropic": 55, "mischief": 101, "mischievous": 164, "mischievousness": 6, "miserable": 737, "misery": 522, "misgiving": 0, "mislead": 108, "mistrust": 62, "mistrustful": 3, "mistrusting": 6, "misunderstood": 325, "mockery": 239, "mocking": 244, "mockingly": 12, "modest": 440, "monotone": 225, "monster": 5369, "moody": 546, "mopey": 4, "morose": 99, "mortified": 49, "motivated": 267, "mournful": 39, "mournfulness": 3, "mourning": 140, "mouthed": 412, "moved": 2054, "muddled": 512, "mum": 388, "murderous": 696, "musical": 5375, "musing": 14, "muster": 187, "mute": 551, "muted": 199, "muttering": 67, "mysterious": 2673, "mystical": 322, "mystified": 54, "naive": 1204, "napping": 20, "narrow": 398, "nasty": 2158, "natural": 2744, "natured": 273, "naughty": 342, "nausea": 112, "nauseated": 31, "nauseous": 68, "needy": 106, "nefarious": 155, "negating": 18, "negative": 2207, "negativity": 68, "neglected": 336, "nerdy": 281, "nerved": 2, "nerves": 389, "nervous": 627, "nervously": 45, "nervousness": 31, "nescient": 0, "nettled": 1, "neutral": 206, "neutrality": 25, "nice": 12111, "noisy": 166, "nonbelief": 0, "nonchalance": 25, "nonchalant": 49, "noncommittal": 4, "noncompliant": 0, "nonplussed": 18, "nonsensical": 494, "normal": 3121, "nosey": 32, "nostalgic": 562, "nosy": 68, "numb": 146, "obedient": 37, "objecting": 9, "objection": 75, "objective": 485, "obliged": 93, "obliging": 17, "oblivious": 286, "observant": 90, "observing": 168, "obsessed": 1357, "obstinate": 18, "occupied": 309, "odd": 3496, "odious": 79, "off": 39204, "offended": 738, "offensive": 1306, "ogling": 51, "okay": 4585, "on": 217895, "open": 4517, "openness": 41, "opposed": 851, "oppositional": 1, "oppressed": 120, "optimism": 198, "optimistic": 303, "ordering": 107, "orgasmic": 26, "ornery": 27, "ouch": 121, "out": 110056, "outburst": 72, "outcry": 26, "outed": 22, "outlandish": 241, "outrage": 143, "outraged": 118, "outspoken": 46, "overbearing": 322, "overexcited": 1, "overjoyed": 42, "overshadowed": 239, "overstrung": 0, "overwhelmed": 228, "overworked": 89, "overwrought": 245, "pain": 2337, "pained": 98, "painful": 2677, "painfully": 1420, "panic": 524, "panicked": 63, "panicky": 24, "paralyzed": 136, "paranoid": 414, "passionate": 646, "passive": 247, "patience": 556, "patient": 1136, "patronizing": 121, "pause": 346, "pausing": 74, "peaceful": 331, "peculiar": 384, "peering": 51, "peeved": 24, "peevish": 10, "pensive": 52, "peppy": 24, "perceptive": 123, "perfidious": 3, "perky": 179, "perplexed": 104, "perplexing": 109, "persistent": 139, "personable": 96, "perturbed": 27, "perverse": 295, "pesky": 109, "pessimism": 47, "pessimistic": 102, "pestered": 12, "petitioning": 2, "petrified": 92, "petty": 494, "petulant": 79, "picked": 2130, "piercing": 159, "pinched": 23, "pious": 40, "piqued": 30, "pissed": 14, "pitiable": 79, "pitiful": 551, "pity": 1381, "pitying": 62, "placated": 10, "placation": 1, "placid": 107, "plain": 3677, "plaintive": 21, "planning": 767, "playful": 261, "playfully": 65, "pleading": 68, "pleasant": 1332, "pleased": 710, "pleasing": 454, "pleasurable": 88, "pleasure": 1883, "pleasured": 13, "pliant": 5, "plotting": 379, "poignant": 960, "pointed": 793, "poised": 64, "polite": 190, "pompous": 310, "ponder": 201, "pondering": 128, "pooping": 13, "pop": 2261, "posing": 362, "positive": 3130, "positivity": 14, "possibly": 4447, "pout": 41, "pouting": 69, "pouty": 41, "powerful": 3972, "powerless": 101, "pranking": 1, "precarious": 62, "predatory": 79, "prejudiced": 88, "preoccupied": 68, "prepared": 1170, "preparing": 343, "pretending": 662, "pretentious": 1566, "prideful": 9, "priggish": 18, "primed": 26, "private": 1715, "processing": 57, "propositioning": 2, "proud": 1269, "provocative": 425, "provoke": 174, "provoked": 111, "provoking": 1108, "prying": 19, "psycho": 1543, "psychotic": 693, "puckish": 2, "puerile": 164, "pugnacious": 10, "punished": 229, "punishing": 75, "punitive": 3, "punk": 778, "puppyish": 0, "purposeful": 45, "pursed": 10, "put": 15369, "putting": 2355, "puzzled": 243, "puzzlement": 21, "qualms": 91, "quarrelsome": 10, "queasy": 57, "quenched": 9, "questionable": 529, "questioning": 375, "questioningly": 1, "quiet": 1758, "quietness": 17, "quilt": 33, "quirky": 1203, "quizzical": 9, "rabid": 243, "racked": 40, "radiant": 133, "rage": 740, "raged": 13, "ragged": 84, "raging": 353, "rancorous": 3, "randy": 748, "rapt": 27, "rattled": 33, "raving": 203, "reactive": 19, "ready": 2190, "realization": 371, "reassured": 34, "rebellious": 352, "rebuke": 13, "recalling": 100, "receptive": 29, "reckless": 232, "recoil": 39, "recoiling": 9, "reflecting": 198, "reflection": 577, "reflective": 131, "refulgent": 0, "refusing": 193, "regret": 1227, "regretful": 26, "rejected": 454, "rejecting": 75, "rejection": 191, "rejoicing": 20, "relaxation": 29, "relaxed": 260, "relentless": 351, "relief": 1547, "relieved": 204, "relived": 14, "reluctant": 434, "reluctantly": 271, "remorse": 210, "remorseful": 36, "repelled": 46, "repressed": 319, "reproach": 14, "reproachful": 0, "repugnance": 2, "repugnant": 140, "repulsed": 122, "repulsion": 94, "resent": 74, "resentful": 65, "resenting": 2, "resentment": 133, "reserved": 325, "resignation": 59, "resigned": 105, "resilience": 32, "resistance": 321, "resistant": 49, "resistent": 0, "resisting": 41, "resolute": 34, "resolved": 415, "responsive": 16, "restful": 12, "resting": 82, "restless": 190, "restlessness": 8, "restrained": 382, "restraint": 245, "retaliating": 1, "retaliatory": 12, "rethinking": 10, "reticence": 17, "reticent": 32, "revengeful": 14, "reverent": 17, "revolted": 32, "revulsion": 53, "righteous": 263, "rigid": 191, "riled": 22, "riotous": 52, "riveted": 120, "roar": 117, "roguish": 47, "roiled": 0, "rough": 1221, "roused": 8, "rude": 511, "rueful": 11, "ruffled": 23, "ruminating": 6, "rustled": 9, "ruthless": 666, "sad": 6171, "sadden": 11, "saddened": 130, "sadistic": 802, "sadness": 708, "salacious": 85, "salivating": 21, "sanctimonious": 82, "sane": 351, "sanguine": 14, "sappy": 603, "sarcasm": 281, "sarcastic": 403, "sardonic": 132, "sassy": 243, "sated": 14, "satiated": 13, "satirical": 407, "satisfaction": 347, "satisfied": 654, "satisfy": 544, "saturnine": 5, "saucy": 85, "savage": 664, "scandalized": 16, "scare": 1381, "scared": 1828, "scary": 5992, "scattered": 256, "schadenfreude": 5, "scheming": 273, "scoffer": 0, "scoffing": 11, "scorn": 71, "scorned": 78, "scornful": 15, "scowl": 64, "scowling": 48, "scream": 1585, "screaming": 1555, "scrutinizing": 5, "sealed": 180, "searching": 1056, "secretive": 77, "secretively": 1, "secure": 259, "sedate": 60, "seduction": 227, "seductive": 304, "seething": 84, "self": 7343, "sensual": 300, "sentimental": 834, "serene": 96, "serious": 6555, "seriousness": 287, "servile": 9, "set": 15200, "severe": 537, "shabby": 160, "shady": 258, "shaken": 128, "shaky": 443, "shame": 4215, "shamed": 45, "shamefaced": 2, "shameful": 249, "shameless": 330, "sharp": 1384, "sheepish": 16, "sheepishness": 3, "shelled": 16, "shifty": 68, "shock": 2398, "shocked": 1460, "shocking": 2183, "shockingly": 311, "shook": 119, "shout": 291, "shouting": 473, "shrewd": 95, "shy": 805, "shyness": 31, "sick": 3129, "sicken": 11, "sickened": 62, "sigh": 249, "silenced": 41, "silent": 2933, "silliness": 462, "silly": 6012, "simmering": 48, "simper": 5, "simpering": 55, "simple": 6539, "simplicity": 448, "sincere": 572, "sinful": 61, "singing": 2938, "sinister": 1030, "sinisterly": 7, "sizing": 6, "skeptic": 84, "skeptical": 270, "skeptically": 3, "skepticism": 62, "sketchy": 154, "skittish": 8, "slack": 195, "sleazy": 1019, "sleepy": 296, "slick": 687, "slothful": 3, "slow": 7054, "sluggish": 166, "sly": 360, "smarmy": 198, "smart": 2883, "smashed": 201, "smile": 1785, "smiley": 72, "smiling": 537, "smirk": 152, "smirking": 63, "smoldering": 54, "smooching": 17, "smooth": 641, "smug": 320, "smugness": 57, "snake": 867, "snappy": 295, "snarky": 34, "snarl": 40, "snarled": 1, "snarling": 60, "snarly": 3, "sneaky": 87, "sneer": 41, "sneering": 100, "sneeze": 23, "sneezing": 15, "snicker": 102, "snickering": 37, "snide": 54, "sniggering": 10, "sniveling": 32, "snobbish": 90, "snobby": 115, "snooty": 76, "snotty": 88, "sociable": 10, "soft": 1915, "solemn": 90, "solicitous": 8, "solitary": 159, "solitude": 104, "somber": 195, "somberly": 1, "somnolent": 7, "soothed": 1, "sore": 183, "sorrow": 228, "sorrowful": 44, "sorry": 5039, "sour": 314, "spaced": 90, "spacing": 5, "spastic": 47, "speaking": 2462, "specious": 5, "speculative": 41, "speechless": 183, "spent": 3851, "spirited": 754, "spiritless": 13, "spite": 1128, "spiteful": 73, "spoiled": 895, "spooked": 50, "squeamish": 155, "staggered": 36, "stalker": 312, "stare": 430, "staring": 654, "starstruck": 15, "started": 6006, "startled": 97, "stately": 46, "steadfast": 33, "steady": 433, "stealthy": 19, "steamed": 9, "steaming": 280, "steeling": 10, "steely": 70, "stern": 336, "stiff": 864, "stifled": 28, "stifling": 72, "still": 34089, "stillness": 43, "stimulated": 46, "stinky": 80, "stirred": 92, "stoic": 231, "stoical": 8, "stolid": 58, "stoned": 322, "storming": 41, "stormy": 128, "stout": 27, "straight": 5601, "strained": 257, "strange": 5882, "stressed": 137, "stricken": 223, "strict": 336, "strong": 6626, "struck": 937, "stubborn": 179, "stubbornness": 31, "studious": 13, "studying": 417, "stumped": 27, "stung": 31, "stunned": 465, "stupefaction": 3, "stupefied": 10, "stupefy": 5, "stupid": 11523, "stuporous": 3, "suave": 269, "subdued": 288, "sublime": 397, "submissive": 64, "suffering": 1551, "suggestive": 213, "sulking": 40, "sulky": 22, "sullen": 117, "sullenness": 1, "sunny": 465, "superior": 1976, "superiority": 119, "suppressed": 104, "suppressing": 36, "suppression": 33, "sure": 16648, "surly": 118, "surprise": 4483, "surprised": 5002, "surprising": 1996, "surprisingly": 2832, "surreptitious": 2, "suspect": 1950, "suspecting": 57, "suspense": 5059, "suspicion": 346, "suspicious": 598, "suspiciously": 137, "suspiciousness": 2, "swaggering": 29, "swearing": 369, "sympathetic": 1462, "sympathizing": 56, "sympathy": 1308, "taciturn": 54, "talkative": 106, "talking": 5875, "tantalized": 1, "tart": 161, "tasteful": 165, "tattling": 5, "taunt": 39, "taunting": 57, "taut": 250, "tearful": 72, "teary": 65, "tease": 211, "teasing": 96, "tempered": 163, "tempest": 157, "tempestuous": 29, "tempted": 423, "tenacious": 134, "tender": 582, "tenderness": 207, "tense": 973, "tensed": 23, "tension": 3274, "tentative": 76, "terrified": 394, "terror": 1511, "terrorized": 139, "terrorizing": 140, "terse": 33, "testy": 10, "tetchy": 1, "thankful": 214, "thinking": 7486, "thought": 22569, "thoughtful": 632, "thoughtfulness": 32, "threat": 874, "threatened": 408, "threatening": 725, "thrilled": 432, "thrown": 2798, "thunderstruck": 2, "thwarted": 101, "ticked": 139, "tickled": 56, "tied": 913, "tiered": 5, "tight": 1291, "tightlipped": 0, "timid": 158, "timidly": 17, "timidness": 1, "tired": 2516, "tiredly": 11, "tiredness": 8, "titillated": 13, "tolerant": 121, "tongue": 992, "tormented": 333, "touched": 1036, "tough": 3057, "toying": 53, "tragic": 2099, "tragical": 14, "tranquil": 44, "tranquility": 41, "transfixed": 66, "traumatized": 172, "trembling": 37, "trepid": 0, "trepidation": 72, "trickster": 18, "tricky": 195, "triumphant": 121, "troubled": 901, "troublesome": 94, "troubling": 144, "trusting": 120, "trustworthy": 58, "tumultuous": 66, "turbulent": 156, "twinkly": 5, "umbrage": 12, "umbrageous": 0, "unaffected": 61, "unagitated": 0, "unamused": 5, "unappreciative": 15, "unapproachable": 5, "unassertive": 0, "unassuming": 80, "unaware": 503, "unbelief": 17, "unbelievable": 2580, "unbelieving": 8, "unbothered": 0, "uncaring": 95, "uncertain": 214, "uncertainly": 4, "uncertainty": 144, "uncivil": 5, "uncomfortable": 962, "uncommitted": 1, "uncommunicative": 16, "uncomprehending": 11, "uncompromising": 209, "unconcerned": 24, "unconfident": 5, "unconvinced": 37, "uncooperative": 29, "uncurious": 0, "undecided": 33, "underhanded": 36, "understanding": 1941, "undesirable": 42, "unease": 101, "uneasily": 27, "uneasiness": 31, "uneasy": 268, "unemotional": 92, "unenthusiastic": 24, "unexcited": 1, "unexpected": 1520, "unfamiliar": 325, "unfathomable": 84, "unfazed": 18, "unfeeling": 44, "unfocused": 142, "unforeseen": 27, "unforgiving": 73, "unforthcoming": 0, "unfortunate": 1294, "unfriendly": 89, "unhappy": 534, "unhinged": 155, "unimpressed": 80, "uninformed": 57, "uninspired": 922, "uninterested": 103, "uninvolved": 37, "unique": 3882, "unlikeable": 455, "unmoved": 26, "unnerved": 15, "unpleasant": 746, "unprepared": 85, "unquiet": 7, "unreactive": 0, "unresolved": 168, "unrestrained": 50, "unruffled": 2, "unsatisfied": 130, "unsettled": 49, "unsociable": 5, "unspeaking": 0, "unspoken": 127, "unstrung": 4, "unsuccessful": 218, "unsure": 324, "unsurprised": 7, "unsuspecting": 384, "unswayed": 0, "unsympathetic": 336, "untouched": 123, "untroubled": 8, "untrusting": 7, "unwanted": 188, "unwavering": 41, "unwelcoming": 12, "unwell": 11, "unwilling": 263, "unyielding": 28, "up": 85845, "upbeat": 282, "uplifting": 486, "uppity": 30, "upset": 968, "uptight": 249, "useless": 944, "vacant": 126, "vacuous": 157, "vanquished": 36, "vehement": 20, "vengeful": 243, "venomous": 61, "vex": 3, "vexation": 3, "vexed": 14, "vicious": 766, "victorious": 75, "vigilant": 9, "vile": 379, "villainous": 304, "vindictive": 73, "violence": 7009, "violent": 3425, "viperous": 0, "vituperative": 4, "vocal": 369, "vocalized": 3, "vulgar": 474, "vulnerability": 230, "vulnerable": 556, "wacky": 618, "waiting": 3537, "wanted": 8805, "wanting": 2055, "wanton": 55, "wariness": 1, "warm": 1339, "wary": 114, "wasted": 3814, "watch": 43981, "watchful": 38, "watching": 29348, "wavering": 37, "weariness": 45, "weary": 335, "weeping": 119, "weird": 4035, "welcome": 1151, "welcoming": 55, "whatever": 4422, "whimpering": 43, "whimsical": 217, "whisper": 114, "whistle": 134, "white": 8841, "wicked": 814, "wild": 2714, "willful": 47, "willing": 2013, "wily": 84, "wink": 196, "wired": 98, "wishful": 56, "wistful": 108, "wistfully": 19, "withdraw": 37, "withdrawn": 102, "withheld": 25, "withholding": 33, "woe": 61, "woeful": 173, "wonder": 6770, "wondering": 2284, "wonderment": 47, "wooly": 12, "woozy": 5, "worn": 631, "worried": 763, "worrisome": 16, "worry": 1026, "worrying": 222, "worryingly": 8, "wounded": 588, "wow": 2490, "wrathful": 15, "wrathfully": 0, "wrecked": 156, "wretched": 456, "wronged": 151, "wroth": 3, "wry": 192, "yawn": 400, "yawning": 93, "yearning": 196, "yell": 266, "yelling": 556, "yielding": 22, "yuck": 120, "zany": 293, "zealous": 77, "zen": 143, "zoned": 24}