aback
abashed
abhor
abhorred
abhorrence
abhorrent
abominable
abound
absent
absorbed
acceptance
accepted
accepting
accommodating
accomplished
accordant
accursed
accusatory
accused
accusing
acerbic
acidic
active
acute
adamant
addled
admiration
admit
adoration
adoring
adrift
adversarial
affability
affected
affectionate
afflicted
affronted
aflutter
afraid
agape
aggravated
aggravation
aggression
aggressive
aggrieve
aggrieved
aghast
agitated
agog
agonized
agreeable
agressive
airhead
alarm
alarmed
alarming
alert
alerted
alienated
allergic
alleviated
alluring
aloof
amatory
amazed
amazement
amazing
ambition
ambitious
ambivalence
ambivalent
amenable
amiable
amicable
amused
amusement
analytical
analyzing
anger
angered
angrily
angry
angst
anguish
anguished
animated
animosity
annoyance
annoyed
annoying
anoretic
antagonistic
antagonized
anticipated
anticipating
anticipation
anticipative
anticipatory
antipathy
antsy
anxiety
anxious
anxiously
apathetic
apathy
apologetic
appalled
appallingly
appeased
appeasing
appreciative
apprehension
apprehensive
approve
approved
approving
argue
argumentative
aroused
arrogance
arrogant
arrogantly
artificial
ashamed
aspiring
assertive
assertively
assessing
assured
astonished
astonishment
astounded
attempting
attentive
attentiveness
attracted
avenging
averse
aversion
aversive
avid
avoiding
awaiting
awakened
aware
awareness
awe
awed
awe-inspiring
awestruck
awe-struck
awful
awkward
awkwardness
axed
backhanded
badly
baffle
baffled
baffling
baked
banal
barking
bashful
beaming
bearish
beat
beaten
bedeviled
befuddled
begging
begrudge
begrudged
begrudging
begrudgingly
beguiled
belated
belittling
belligerence
belligerent
belonging
bemused
bemusement
benevolence
benevolent
benumbed
berate
berating
bereaved
bereft
beseeching
bested
betrayal
betrayed
bewildered
bewilderment
bi
biggety
bilious
biting
bitter
bittersweet
blaming
bland
blank
blasã©
blase
blazed
bleak
bleary
blessed
blew
blinded
blindsided
bliss
blissful
blissfully
blithe
blown
blue
blues
bluffing
blunt
blushing
blustering
boastful
boggled
boiling
boiling.
boisterous
bold
bored
boredom
boring
bothered
bounder
brashness
bratty
brave
bright
bristling
broken
brokenhearted
brokenheartedly
brooding
broody
bruised
brusque
bug-eye
bug-eyed
bulging
bully
bullying
bummed
buoyant
burdened
burn
bursting
bushed
cagey
cagy
calculating
callous
callused
calm
calming
calmness
canny
cantankerous
capable
capricious
captivated
captive
carefree
careful
careless
caring
catty
caustic
cautionary
cautious
cavalier
celebrating
celebration
censure
centered
certain
chafed
chagrin
chagrine
chagrined
chagrinned
challenge
challenged
challenging
chaotic
charged
charmed
charming
chary
cheated
cheeky
cheered
cheerful
cheering
cheerless
cheery
cheesy
chesty
chide
chiding
childish
childishly
childlike
chill
chilled
chilling
chipper
chirpy
choleric
chortling
chuckle
chuckling
churlish
circumspect
clamorous
clash
clear
clenched
clever
closed
close-lipped
closemouthed
close-mouthed
cloy
clueless
clutched
cluttered
cockeyed
cockiness
cocksure
cocky
cognizant
cold
cold-hearted
collected
collusive
colonized
combative
comedic
comfort
comfortable
comforted
comical
commanding
commiserating
commiserative
communicative
compassion
compassionate
competent
competitive
complacence
complacency
complacent
complacently
complain
complaining
composed
comprehending
compulsive
concealed
conceding
conceited
concentrated
concentrating
concentration
concern
concerned
conciliatory
conclusive
condemning
condescending
condoling
confidence
confident
confidently
conflicted
confound
confounded
confrontational
confused
confusion
congenial
conniving
conscious
conservative
considerate
considering
considering\
consoling
conspiratorial
conspiring
consternation
constipated
constrained
consumed
consuming
contained
contemplate
contemplating
contemplation
contemplative
contempt
contemptuous
content
contented
contentious
contently
contentment
contradictory
contrary
contrite
controlled
controlling
controversial
contumacious
convinced
cool
cooperative
cordial
courageous
covert
cowardly
coy
crabby
crafty
cranky
crazed
crazy
credulous
creepy
crestfallen
cringing
critical
cross
crotchety
crude
cruel
crushed
cry
crying
cryptic
culpable
cunning
curios
curiosity
curious
cutting
cynic
cynical
cynicism
dalliance
dandy
dangerous
darkly
daunted
daydream
daydreaming
dazed
dazzled
deadly
deadpan
debate
debating
debauched
deceitful
deceived
deceiving
deceivingly
deception
deceptive
deciding
decisive
dedicated
deered
defeat
defeated
defenseless
defensive
defiance
defiant
deflated
degage
degrading
dejected
dejection
deliberate
deliberating
delight
delighted
delightful
delirious
delirium
delude
delusional
demanding
demeaning
demented
demised
demoralized
demure
denied
denouncing
depleted
deplorable
deprecating
depressed
depression
deprived
deranged
derision
derisive
derogatory
desire
desiring
desirous
desolate
despair
despaired
despairing
desperate
desperation
despise
despondent
destitute
destroyed
detached
determination
determined
determining
deterred
detest
detestable
detesting
detriment
devastated
deviant
devilish
devious
devising
diffident
dilatory
diligent
dimwitted
dire
disagree
disagreeable
disagreement
disappointed
disappointing
disappointment
disapproval
disapproving
disbelief
disbelieve
disbelieving
discerning
discombobulated
discomfited
discomfort
discomforted
disconcerted
disconnected
disconsolate
discontent
discontented
discounted
discouraged
discovery
discriminating
discussed
disdain
disdained
disdainful
disdainfully
disenchanted
disengaged
disgraced
disgruntled
disgruntlement
disgust
disgusted
disgustedly
disgusting
disheartened
dishonest
disillusioned
disinclined
disingenuous
disinterest
disinterested
disjointed
dislike
disliked
disliking
dismal
disman
dismay
dismayed
dismissive
disobedient
disorderly
disoriented
dispair
disparaging
dispassionate
dispirited
dispiritedness
displeased
displeasure
disquiet
disquieted
disregard
disrespectful
disrupted
disruptive
dissatisfaction
dissatisfied
dissatisfy
dissecting
dissociated
dissonant
distain
distant
distaste
distasteful
distracted
distraught
distress
distressed
distressing
distrust
distrustful
distrusting
disturbed
diverted
dodgy
doleful
doltish
dominant
dominating
domineering
done
doomed
dopey
doting
doubt
doubter
doubtful
doubtfully
doubtfulness
doubting
dour
down
downcast
downhearted
downheartedness
downtrodden
dozing
drained
dramatic
drawn
dread
dreadful
dreading
dreaming
dreamy
dreary
driven
drowsy
drugged
drunk
drunkenness
dubiety
dubious
dubiously
dull
dumb
dumbfound
dumbfounded
dumbstruck
dumfounded
dupe
duplicitous
dysphoric
eager
eagerness
earnest
easy
ebullient
ecstasy
ecstatic
ecstatically
edgy
eerie
effulgent
egoistic
egotistical
egregious
elated
elation
electrified
elusive
embarrassed
embarrassment
embittered
embody
emotional
emotionless
empathetic
empathic
empathy
emptiness
empty
enamored
enchanted
encouraged
encouragement
encouraging
endeared
endearing
enduring
energetic
energized
engaged
engrossed
engrossment
enigmatic
enjoy
enjoying
enjoyment
enlightened
enmity
ennui
enraged
enraging
enraptured
entertained
enthralled
enthused
enthusiasm
enthusiastic
enticed
entranced
envious
envy
erotically
estranged
etched
euphoric
evaluating
evasive
evil
evoke
exacerbated
exalted
examining
exasperate
exasperated
exasperation
excited
excitedly
excitement
exclamation
exclamatory
exhausted
exhaustion
exhaustive
exhilarated
exhilaration
exited
expectant
expectation
expecting
explain
explaining
exploitive
explosive
exposure
expressive
exuberant
exultant
exulted
facetious
failure
faint-hearted
fair
fake
fake-happy
faking
falter
famished
fanatic
fanciful
fart
fascinated
fastidious
fatigue
fatigued
faultfinding
favorable
fawning
fazed
fear
feared
fearful
fearing
fearless
fearsome
feckless
fed-up
feeble
feign
felicitous
ferocious
ferocity
festive
fidgety
fiendish
fierce
fiery
fighting
fine
finished
firm
fishy
fixated
fixed
flabbergasted
flabergasted
flaming
flat
flaunting
flighty
flippant
flipped
flirtation
flirtatious
flirty
floored
flummoxed
flustered
focus
focused
focusing
foiled
foolish
forbearing
forbidding
forced
forceful
forfeited
forlorn
fortunate
forward
foul
fractious
fragile
frantic
fraudulent
fraught
frazzled
freaked
frenzied
fretful
friendliness
friendly
fright
frightened
frightening
frigid
frisky
frolicker
frown
frowning
frozen
frumpy
frustrated
frustration
fulfilled
fumed
fuming
fun
funny
furious
furiously
furiousness
furrowed
furtive
fury
fussy
galled
galling
gasp
gasped
gasping
gay
gazing
genial
gentle
genuine
ghastly
giddy
giggle
giggling
glad
gladdened
gladiola
gladness
gladsome
glare
glaring
glazed
glee
gleeful
gleefully
glib
gloating
gloom
gloomy
glowering
glowing
glum
gnarl
gnarling
gobsmacked
good
good-natured
goofy
gossipy
grandiose
grateful
gratified
gratulatory
grave
great
greedy
greeting
grief
grief-stricken
grieved
grieving
grim
grimace
grimacing
grin
grinning
griping
gross
grossed
grossed-out
grouchy
growl
growling
grudge
grudging
gruff
grumbling
grumpy
grunt
grunting
guarded
guilty
gulp
haggard
halfhearted
halted
hapless
happiness
happy
harassed
hard
hardened
harmful
harried
harsh
hate
hateful
hating
hatred
haughty
haunted
hazy
headshake
heartache
heartbroken
heartsick
heated
heavyhearted
heckle
heedful
heinous
helpful
helpless
hesitant
hesitantly
hesitating
hesitation
high
hollering
homicidal
honest
honorable
hope
hopeful
hopefulness
hopeless
hoping
horny
horrible
horrified
horrify
horrifying
horror
horror-stricken
hostile
hostility
hot
hotshot
huffiness
huffy
humble
humbled
humdrum
humiliated
humility
humming
humor
humored
humorous
hunger
hungry
hunted
hurt
hurtful
hurting
hush
hushed
hyper
hyperactive
hypnotized
hypocritical
hysteria
hysterical
idiotic
ignorant
ignoring
ill
ill-tempered
imaginative
immature
immersed
impacted
impartial
impassioned
impassive
impatience
impatient
imperious
impersonal
impertinent
impish
implicated
imploring
important
impressed
impulsive
inactive
inadequate
inarticulate
inattentive
inaudible
inauthentic
incapable
incensed
incertain
incertitude
incited
incomprehensible
inconspicuous
incredulity
incredulous
incredulously
inculpate
inculpated
incurious
indecipherable
indecision
indecisive
indifferent
indifferently
indignant
indolent
inebriated
inert
infatuating
inferior
inferiority
inflamed
informal
informing
infuriated
inhibited
inhibiting
inimical
injured
innocent
inpatient
inquiring
inquisitive
insane
inscrutable
insecure
insecurity
insensitive
insest
insidious
insinuating
insistence
insistent
insisting
insolent
insouciance
insouciant
inspired
instigating
instructing
insubordinate
insular
insulted
insulting
intelligence
intense
intensely
intensity
intensive
intent
intentional
interacting
interest
interested
interjecting
internalizing
interrogating
interrupting
intimidated
intimidating
intolerant
intoxicated
intrest
intrigue
intrigued
intriguing
introspective
invested
investigate
investigative
investigatory
invigorated
involved
irascible
irate
ire
ireful
irked
ironic
irony
irresolute
irritable
irritably
irritated
irritation
isolated
jabbed
jaded
jarred
jarring
jaunty
jealous
jeering
jesting
jilted
jittery
jocular
joking
jolly
jolted
jovial
joy
joyful
joyfulness
joyless
joyous
jubilant
jubilation
judgemental
judging
judgmental
judicious
jumpy
justified
kayoed
keen
kind
kindhearted
kiss
knowing
knowledgable
knowledgeable
kosher
lackadaisical
lackluster
laconic
lambaste
lamentable
lamenting
lascivious
laugh
laughing
laughter
lazy
leaving
lecherous
lecturing
leering
leery
letdown
lethargic
levelheaded
lewd
libidinous
lifeless
lighthearted
listening
listless
lively
livid
loaded
loath
loathe
loathing
loathsome
locked
loneliness
lonely
longing
looking
loony
loss
lost
loud
lousy
love
loving
lowliness
lurid
lustful
lusting
lusty
lying
mad
maddened
madness
malcontent
maleficent
malevolant
malevolent
malice
malicious
malignant
maniacal
manipulative
marveled
master
mean
mean-hearted
meaningful
mean-spirited
meditative
meek
melancholic
melancholy
mellow
menace
menacing
mental
merrily
merry
mesmerized
miffed
mild
mincing
mindful
mindless
mirrored
mirth
mirthful
misanthropic
mischief
mischievous
mischievousness
miserable
misery
misgiving
mislead
mistrust
mistrustful
mistrusting
misunderstood
mockery
mocking
mockingly
modest
monotone
monster
moody
mopey
morose
mortified
motivated
mournful
mournfulness
mourning
moved
muddled
mum
murderous
musical
musing
muster
mute
muted
muttering
mysterious
mystical
mystified
naive
napping
narrow
nasty
natural
naughty
nausea
nauseated
nauseous
needy
nefarious
negating
negative
negativity
neglected
nerdy
nerved
nerves
nervous
nervously
nervousness
nescient
nettled
neutral
neutrality
nice
noisy
nonbelief
nonchalance
nonchalant
noncommittal
noncompliant
nonplussed
nonsensical
normal
nosey
nostalgic
nosy
numb
obedient
objecting
objection
objective
obliged
obliging
oblivious
observant
observing
obsessed
obstinate
occupied
odd
odious
offended
offensive
off-put
off-putting
ogling
okay
open
openness
opposed
oppositional
oppressed
optimism
optimistic
ordering
orgasmic
ornery
ouch
outburst
outcry
outed
outlandish
outrage
outraged
outspoken
overbearing
overexcited
overjoyed
overshadowed
overstrung
overwhelmed
overworked
overwrought
pain
pained
painful
painfully
panic
panicked
panicky
panic-stricken
paralyzed
paranoid
passionate
passive
patience
patient
patronizing
pause
pausing
peaceful
peculiar
peering
peeved
peevish
pensive
peppy
perceptive
perfidious
perky
perplexed
perplexing
persistent
personable
perturbed
perverse
pesky
pessimism
pessimistic
pestered
petitioning
petrified
petty
petulant
picked-on
piercing
pinched
pious
piqued
pissed
pit1ful
pitiable
pitiful
pity
pitying
placated
placation
placid
plain
plaintive
planning
playful
playfully
pleading
pleasant
pleased
pleasing
pleasurable
pleasure
pleasured
pliant
plotting
poignant
pointed
poised
polite
pompous
ponder
pondering
pondring
pooping
pop-eyed
posing
positive
positivity
possibly
pout
pouting
pouty
powerful
powerless
pranking
precarious
predatory
prejudiced
preoccupied
prepared
preparing
pretending
pretentious
prideful
priggish
primed
private
processing
propositioning
proud
provocative
provoke
provoked
provoking
prying
psycho
psychotic
puckish
puerile
pugnacious
punished
punishing
punitive
punk
puppyish
purposeful
pursed
puzzled
puzzlement
qualms
quarrelsome
queasy
quenched
questionable
questioning
questioningly
quiet
quietness
quilt
quirky
quizical
quizzical
rabid
racked
radiant
rage
raged
ragged
raging
rancorous
randy
rankled
rapt
rattled
raving
reactive
ready
realization
reassured
rebellious
rebuke
rebutting
recalling
receptive
reckless
recoil
recoiling
reflecting
reflection
reflective
refulgent
refusing
regret
regretful
rejected
rejecting
rejection
rejoicing
relaxation
relaxed
relentless
relief
relieved
relived
reluctant
reluctantly
remorse
remorseful
repelled
repressed
reproach
reproachful
repugnance
repugnant
repulsed
repulsion
resent
resentful
resenting
resentment
reserved
resignation
resigned
resilience
resistance
resistant
resistent
resisting
resolute
resolved
responsive
restful
resting
restless
restlessness
restrained
restraint
retaliating
retaliatory
rethinking
reticence
reticent
revengeful
reverent
revolted
revulsed
revulsion
righteous
rigid
riled
riotous
riveted
roar
roguish
roiled
rough
roused
rude
rueful
ruffled
ruminating
rustled
ruthless
sad
sadden
saddened
sadistic
sadness
salacious
salivating
sanctimonious
sane
sanguine
sappy
sarcasm
sarcastic
sardonic
sassy
sated
satiated
satirical
satisfaction
satisfied
satisfy
saturnine
saucy
savage
scandalized
scare
scared
scary
scattered
schadenfreude
scheming
scoffer
scoffing
scorn
scorned
scornful
scowl
scowling
scream
screaming
scrutinizing
sealed
searching
secretive
secretively
secure
sedate
seduction
seductive
seething
self-congratulatory
self-conscious
self-controlled
self-deprecating
self-satisfied
sensual
sentimental
serene
serious
seriousness
servile
set
severe
shabby
shady
shaken
shaky
shame
shamed
shamefaced
shameful
shameless
sharp
sheepish
sheepishness
shelled
shellshocked
shifty
shitgrinned
shock
shocked
shocking
shockingly
shook
shout
shouting
shrewd
shuddery
shy
shyness
sick
sicken
sickened
sigh
silenced
silent
silliness
silly
simmering
simper
simpering
simple
simplicity
sincere
sinful
singing
sinister
sinisterly
sizing
skeptic
skeptical
skeptically
skepticism
sketchy
skittish
slack-jawed
sleazy
sleepy
slick
slothful
slow
sluggish
sly
smarmy
smart
smashed
smile
smiley
smiling
smirk
smirking
smoldering
smooching
smooth
smug
smugness
snake-bit
snappy
snarky
snarl
snarled
snarling
snarly
sneaky
sneer
sneering
sneeze
sneezing
snicker
snickering
snide
sniggering
sniveling
snobbish
snobby
snooty
snotty
sociable
soft
solemn
solicitous
solitary
solitude
somber
somberly
somnolent
soothed
sore
sorrow
sorrowful
sorry
sour
spaced
spacing
spastic
speaking
specious
speculative
speechless
spent
spirited
spiritless
spite
spiteful
spoiled
spooked
squeamish
staggered
stalker
stare
staring
starstruck
started
startled
stately
steadfast
steady
stealthy
steamed
steaming
steeling
steely
stern
stiff
stifled
stifling
still
stillness
stimulated
stinky
stirred
stoic
stoical
stolid
stoned
storming
stormy
stout
straight
straight-faced
strained
strange
stressed
stricken
strict
strong
struck
stubborn
stubbornness
studious
studying
stumped
stung
stunned
stupefaction
stupefied
stupefy
stupid
stuporous
suave
subdued
sublime
submissive
suffering
suggestive
sulking
sulky
sullen
sullenness
sunny
superior
superiority
suppressed
suppressing
suppression
sure
surly
surprise
surprised
surprising
surprisingly
surreptitious
suspect
suspecting
suspense
suspicion
suspicious
suspiciously
suspiciousness
swaggering
swearing
sympathetic
sympathizing
sympathy
taciturn
talkative
talking
tantalized
tart
tasteful
tattling
taunt
taunting
taut
tearful
teary
tease
teasing
tempest
tempestuous
tempted
tenacious
tender
tenderness
tense
tensed
tension
tentative
terrified
terror
terrorized
terrorizing
terse
testy
tetchy
thankful
thinking
thought
thoughtful
thoughtfulness
threat
threatened
threatening
thrilled
thrown
thunderstruck
thwarted
ticked
tickled
tiered
tightlipped
tight-lipped
timid
timidly
timidness
tired
tiredly
tiredness
titillated
tolerant
tongue-tied
tormented
touched
tough
toying
tragic
tragical
tranquil
tranquility
transfixed
traumatized
trembling
trepid
trepidation
trickster
tricky
triumphant
troubled
troublesome
troubling
trusting
trustworthy
tumultuous
turbulent
twinkly
umbrage
umbrageous
unaccepting
unaffected
unagitated
unamused
unappreciative
unapproachable
unaroused
unassertive
unassuming
unaware
unbelief
unbelievable
unbelieving
unbothered
uncaring
uncertain
uncertainly
uncertainty
uncivil
uncomfortable
uncommitted
uncommunicative
uncomprehending
uncompromised
uncompromising
unconcerned
unconfident
unconvinced
uncooperative
uncurious
undecided
underhanded
understanding
undesirable
unease
uneasily
uneasiness
uneasy
unemotional
unenthusiastic
unexcited
unexpectant
unexpected
unfamiliar
unfathomable
unfazed
unfeeling
unfocused
unforeseen
unforgiving
unforthcoming
unfortunate
unfriendly
unhappy
unhinged
unimpressed
uninformed
uninspired
uninterested
uninvolved
unique
unlikeable
unmoved
unnerved
unpleasant
unpleased
unprepared
unquiet
unreactive
unresolved
unrestrained
unruffled
unsatisfied
unsettled
unsociable
unspeaking
unspoken
unstrung
unsuccessful
unsure
unsurprised
unsuspecting
unswayed
unsympathetic
untouched
untroubled
untrusting
unwanted
unwavering
unwelcoming
unwell
unwilling
unyielding
upbeat
uplifting
uppity
upset
uptight
useless
vacant
vacuous
vanquished
vehement
vengeful
venomous
vex
vexation
vexed
vicious
victorious
vigilant
vile
villainous
vindictive
violence
violent
viperous
vituperative
vocal
vocalized
vulgar
vulnerability
vulnerable
wacky
waiting
wanted
wanting
wanton
wariness
warm
wary
wasted
watch
watchful
watching
wavering
weariness
weary
weeping
weird
welcome
welcoming
whatever
whimpering
whimsical
whisper
whistle
white
wicked
wild
wiling
willful
willing
wily
wink
wired
wishful
wistful
wistfully
withdraw
withdrawn
withheld
withholding
woe
woeful
wonder
wondering
wonderment
wooly
woozy
worn
worn-out
worried
worrisome
worry
worrying
worryingly
wounded
wow
wrathful
wrathfully
wrecked
wretched
wronged
wroth
wry
yawn
yawning
yearning
yell
yelling
yielding
yuck
zany
zealous
zen
zoned
