scared
distressed
doleful
doleful
crestfallen
unimpressed
troubled
miserable
fascinated
guilty
wonder
concerned
dejected
anxious
concerned
contently
confused
hesitant
disinterested
unsure
confused
worried
attentive
levelheaded
neutral
uncertain
stately
worried
reserved
heavyhearted
placid
observant
confused
concerned
melancholy
bored
vulnerable
concerned
tense
worried
deliberate
frustrated
determined
baffled
unsure
complacent
dismayed
bothered
thwarted
bored
keen
tearful
nonchalant
impish
skeptically
perplexed
unbelieving
jaded
concerned
resigned
wavering
wistful
unconvinced
disappointed
discouraged
cynicism
disappointed
contemplating
perplexed
neutral
unsure
unsure
doubtful
passive
testy
doubtful
resigned
discouraged
pondering
pleased
excited
amused
naughty
eager
pleased
content
doubt
restrained
thrilled
coy
happy
eager
amused
pleasant
giddy
envious
anticipation
mum
pondering
concealed
randy
secretive
eager
giddy
playful
entertained
smug
anticipating
uncertain
facetious
eager
sunny
upbeat
glad
smug
exhilarated
elated
{}
timid
reactive
content
joyful
scheming
aroused
sarcastic
smug
troublesome
gratified
calm
joy
leering
delighted
gloating
pleased
drunk
euphoric
content
tired
intoxicated
calm
mischievous
knowledgeable
cheerful
chuckling
pesky
happy
happy
conspiratorial
shifty
devious
relaxed
amusement
coy
haughty
bluffing
gleefully
jeering
smug
drugged
blank
happy
happy
proud
mirthful
mischievous
dishonest
happy
amused
blissful
relieved
elated
interested
appreciative
encouraging
openness
satisfied
joy
affectionate
joyful
happy
assured
amused
roused
overjoyed
delighted
happy
calm
calm
pleased
leering
malicious
elated
satisfaction
contented
wry
upbeat
eager
delighted
overjoyed
enjoyment
disgusted
disapproving
mistrustful
yielding
flabergasted
stern
dismissive
fearful
doubtful
depressed
sullen
upset
gloomy
sad
frightened
forlorn
disappointed
disbelief
sickened
irritated
sad
rejected
depressed
hopeless
sulky
heedful
superior
dejected
pitiful
pouty
fear
aghast
disappointed
shy
mournful
depression
mournful
bothered
sad
surprised
irritated
unhappy
judgemental
leery
dismal
roiled
letdown
doubtful
confused
offended
tired
pouty
displeased
leery
riled
scornful
insistent
displeased
absent
upset
disgruntled
skeptical
sad
betrayal
suspicious
bitter
resentment
skepticism
retaliatory
glowering
discriminating
sleepy
distrustful
disapproving
deprived
joyless
skeptical
inflamed
aloof
steaming
perturbed
overshadowed
irritated
sorrowful
ire
discontent
begrudging
nonplussed
concentration
disapproving
displeased
obstinate
unhappy
disinterested
weary
dour
suspicious
offended
blank
aloof
annoyed
confrontational
determination
disappointed
unimpressed
disinterested
nonchalant
troubled
sad
sad
doleful
disappointed
disappointed
contempt
angry
sad
pensive
confounded
contemplative
disappointed
distressed
implicated
compassionate
saddened
sincere
disappointed
disbelief
brokenheartedly
blue
sorry
sad
concerned
petitioning
vanquished
crying
beseeching
concerned
heartbroken
empty
distressed
surprised
grief
misery
pained
compassion
apologetic
terrified
fearful
scared
unsettled
crying
apprehensive
uneasy
disappointed
sad
sigh
sad
pleading
worried
apathy
hateful
furious
furious
loathing
irate
raging
wroth
galling
disgusted
fuming
violent
hateful
infuriated
murderous
caustic
ferocious
enraged
sneering
sneering
violent
furious
enraged
furious
sneer
disgusted
bitter
infuriated
enraged
hateful
angry
fury
irate
predatory
roiled
hatred
vicious
disgusted
gnarling
hostile
disgusted
smart
violent
eerie
schadenfreude
derisive
planning
neutral
gentle
giddy
entertained
snarling
unlikeable
sarcasm
smug
amused
snarky
unsettled
merry
conniving
happy
bemused
sneering
sneaky
tense
ogling
pompous
spiteful
amusement
sarcastic
cringing
salacious
glad
cruel
sneering
pleased
mockery
elated
content
conniving
gleeful
conceited
happy
merrily
cheerful
joyful
happy
euphoric
joyful
deceitful
delighted
mocking
smug
sunny
jubilant
ecstatic
ecstatic
merry
excited
horny
disgusted
satiated
pleased
contented
smarmy
eager
happy
happy
content
bullying
enduring
jovial
fraudulent
gleeful
mischievous
happy
playful
leering
snide
confident
gratified
amused
superior
infuriated
irked
displeased
steamed
withdraw
bothered
infuriated
miffed
neutral
punk
revolted
grumpy
displeased
disgusted
contemptuous
offended
rancorous
disgusted
miffed
bratty
disgusted
unsettled
sarcastic
sneezing
annoyed
dismayed
finished
scheming
haughty
disgusted
repulsed
peeved
disgusted
discouraged
frustrated
frustrated
belligerent
irritated
smug
nauseous
contempt
grieved
annoyed
distaste
dismayed
accused
sulky
downcast
disgruntled
upset
miffed
sad
regret
sorrow
hurt
wistful
nauseous
disgusted
depressed
aversion
complain
fragile
disgust
irritated
disgusted
sneering
mournful
downcast
sadness
detached
saddened
appalled
bothered
insulted
frustrated
sad
disappointed
mad
defiant
malignant
resentful
unaccepting
cheerless
distressed
leaving
displeased
fuming
disappointed
fastidious
neutral
confused
contempt
stirred
contemptuous
irked
disgusted
fumed
appalled
greeting
irked
frustrated
stung
ornery
miffed
irritated
irritated
superior
aggressive
miffed
snarky
amused
indignant
enraged
understanding
satisfied
doubtful
shame
huffy
contained
intrigued
egotistical
mum
ecstatic
excited
cautious
contained
secretive
excited
satisfied
hesitant
overstrung
plotting
complacent
jealous
contemplating
smug
wanting
annoyed
neutral
furtive
bitter
expecting
restless
revolted
fuming
hungry
awful
eager
upset
pleased
intrest
eager
perplexed
impulsive
kind
wild
anticipating
judging
tranquil
sneering
bemused
keen
delighted
elated
pleased
reluctant
awaiting
happy
spoiled
fake
agreeable
excited
contented
pissed
vexed
cheery
leering
concentration
sardonic
happy
aroused
betrayed
heckle
befuddled
mindless
intrigued
amused
timidly
taunt
open
fortunate
happy
nauseated
pleasant
hungry
afraid
introspective
bold
mad
peeved
pained
loathing
cranky
furiously
sad
disgust
offended
irritated
dissatisfied
discontent
disapproving
disgusted
scowling
dissatisfied
disapproval
steaming
vengeful
anguished
perturbed
peeved
annoyed
grief
cranky
angered
disgusted
revolted
betrayed
haughty
sorrow
repulsed
spiteful
sulking
sickened
enraged
revulsion
wicked
furious
disenchanted
disgusted
disgusted
repulsed
irate
hateful
disgusted
disgustedly
disgusted
huffy
disgusted
unhinged
fuming
disgusted
disgusted
abominable
repulsed
huffy
disgusted
disgust
spiteful
rebuke
disgusted
horrifying
sick
dejected
disgusted
sick
repelled
judgmental
enraged
detestable
repelled
saddened
sickened
shock
revolted
cross
disgusted
repulsed
disgusted
abhor
cross
displeased
sick
disdainful
scornful
peeved
skeptical
contemptuous
scornful
hateful
grouchy
threatening
surly
pissed
disdainful
disdainful
irritated
offended
furious
bitter
repulsed
grudging
unsatisfied
sneering
revulsion
disgusted
disgust
mad
condescending
steamed
irked
superior
callous
contempt
disgusted
detesting
bitter
disdainful
disappointed
contemptuous
offended
resentful
upset
displeased
hostile
discontented
mad
frustrated
incensed
repugnant
rancorous
suspicious
disgusted
malcontent
disdain
pissed
angry
noncompliant
displeased
annoyed
grumpy
harried
offended
disappointed
upset
disgusted
doubtful
angry
dismayed
revolted
offended
unstrung
disgusted
off-put
instigating
discontent
pissed
miffed
revolted
indignant
disdainfully
regretful
frustrated
morose
angry
angry
chafed
upset
distraught
unsettled
cheerless
restrained
angst
threatening
hesitant
distaste
infuriated
disgusted
perplexed
fearful
unhappy
suppressing
terror
uneasy
befuddled
confounded
mournful
hesitant
hostile
disturbed
scornful
grudge
disturbed
helpless
tense
sullen
bitter
flustered
repelled
surprised
offended
aghast
flabbergasted
boiling
shocked
shocked
shocked
thunderstruck
shocked
astonished
exclamation
scared
shocked
astonished
awe
shocked
shocked
shock
shocked
outrage
frightened
astounded
surprised
animated
engaged
shocked
astonished
outraged
dumbfounded
surprised
surprised
hollering
mad
awe
shocked
astonished
shock
dumbstruck
astonished
lurid
shocked
surprised
scared
upset
shocked
terrorized
lamenting
stunned
clamorous
surprise
informing
perplexed
dismayed
aghast
shock
surprise
fearful
crying
surprised
stunned
distressed
stunned
appalled
yawn
vocalized
surprise
appalled
shocked
scared
dismayed
aghast
painfully
shock
astonished
thunderstruck
surprised
surprised
aghast
upset
flustered
boggled
astonished
musical
aghast
awe
speechless
scared
active
displeasure
shocked
surprised
shocked
astonished
upset
disbelief
astounded
startled
dismayed
appalled
hysteria
amazed
shock
shock
shocked
roar
astonishment
aghast
shocked
shocked
shock
flabbergasted
speechless
anxious
alarmed
stunned
anger
appalled
interrupting
surprising
irritable
unimpressed
disgustedly
conceding
disappointed
distain
depressed
uncomfortable
snobbish
upset
vulgar
tired
tired
confused
disgusted
disgusted
sneering
fatigued
tired
lackluster
sleepy
disgusted
incredulity
cloy
saddened
dour
sad
bluffing
unamused
egotistical
repelled
weary
displeased
sour
lost
stormy
nauseated
exhausted
tired
sleepy
sympathizing
cautious
discouraged
depressed
defeated
afraid
dismay
disgusted
pensive
discouraged
disappointed
dupe
frightened
mournful
confused
despondent
distressed
fearful
sympathy
anguished
displeased
distraught
perturbed
revulsed
sad
apprehensive
recoil
nervous
repulsed
surprised
hurt
lost
regretful
sickened
baffle
apologetic
embarrassed
sick
sad
anxious
delighted
excited
surprised
excited
excited
engaged
excited
uncivil
angry
overjoyed
screaming
joyful
overexcited
ecstatic
loud
exhilarated
raged
boisterous
gleeful
barking
cheerful
astonished
excitedly
gleeful
joyous
ecstatic
joyful
joyous
irate
excited
shouting
hostile
joking
excited
taunting
terrified
enraged
irate
elated
terrified
frustrated
distressed
unsure
disturbed
scared
pained
cynical
distressed
nervous
scared
afraid
worried
frightened
terror
scared
fearful
fear
uncertain
frightened
terrified
anxious
dimwitted
apologetic
scared
offended
uncomfortable
distressed
embarrassed
depressed
fraught
scared
worried
sad
angry
reluctant
frightened
agonized
embarrassed
nervous
panicky
aggravated
ferocious
angered
mean-hearted
angry
repulsed
aggressive
alarmed
nervous
fierce
intensive
anxious
rage
savage
furious
tentative
irascible
furious
angry
hostile
scornful
furious
argue
frightened
affronted
mad
intense
venomous
seething
furious
rage
apprehensive
attempting
fuming
aggressive
sneer
enraged
contentious
hateful
offended
kind
discouraged
smirking
content
triumphant
puzzled
smug
smug
confounded
flustered
delighted
self-conscious
irked
smug
acceptance
confident
bemused
resistent
bested
carefree
content
self-satisfied
quirky
annoyed
thinking
gloating
pessimistic
proud
uncertain
reticent
averse
competent
perplexed
sarcastic
smug
accepting
amused
befuddled
rueful
playfully
excited
amused
happy
gratified
bright
foolish
joy
happy
cheerful
perplexed
cheesy
happy
excited
beaming
playful
bright
gratified
whimsical
joyful
chipper
gladdened
gratified
cheerful
pleased
delighted
assured
pleasant
captivated
joy
chirpy
cheerful
exalted
pleasant
blissful
amused
elated
delighted
sunny
content
gleeful
reflective
woeful
humbled
anxiety
disinterested
tense
anticipation
uncomfortable
thankful
peaceful
sheepish
chagrine
stumped
impatient
hurt
hesitant
lifeless
apathetic
pleased
grimace
sorry
suspicious
neutral
inauthentic
victorious
tolerant
content
befuddled
sympathetic
content
confused
gladsome
entertained
content
unsure
content
content
embarrassed
merry
content
benevolent
sheepish
satisfied
satisfied
brusque
amused
sad
befuddled
amused
annoyed
assured
uptight
skeptical
mellow
patronizing
weird
incredulous
pompous
smug
aloof
boastful
smug
wily
smug
mirthful
displeased
bemused
critical
playful
content
childishly
smug
bemused
pompous
incredulous
cavalier
eager
dazed
sneaky
smug
joking
pleased
mischievous
dreamy
grimace
chipper
comical
ornery
relaxed
lewd
smug
content
pleased
lustful
smug
entertained
confident
stoned
comfortable
flirtatious
conceited
willing
aroused
entertained
gleeful
aroused
amused
complacent
arrogant
interest
impish
glad
pompous
playful
passionate
sleepy
giggling
jovial
mocking
cocky
disapproving
dazed
blase
doubting
doubt
troubled
neutral
disbelief
frustrated
gloomy
mopey
acerbic
snotty
irked
begrudging
annoyed
gloating
unimpressed
smirking
dejected
doubting
egotistical
disrespectful
despondent
doubtful
disillusioned
griping
doubtful
satisfied
aloof
unamused
unconvinced
surly
irascible
disbelief
indifferent
exhausted
skepticism
pompous
disappointed
disappointed
derision
confused
wondering
insecure
bored
contemplating
feeble
confused
mischief
thoughtful
pensive
nervous
focused
goofy
wondering
judgemental
distressed
haggard
unsure
alarmed
pensive
undecided
anxious
preoccupied
annoyed
disappointed
neutral
waiting
perplexed
uncertain
indecisive
befuddled
concentrating
frustrated
nervous
secretive
clueless
puzzled
contemplating
satisfied
defeated
wistfully
doubtful
uncertain
anxiety
concerned
bashful
concern
apologetic
sad
sheepish
disappointed
useless
embarrassed
resigned
contemplative
endeared
regretful
admit
serious
self-deprecating
hurtful
embarrassed
ashamed
confused
unenthusiastic
moved
perplexed
resigned
indecision
hurt
tranquil
resigned
arrogance
doubtful
guilty
happy
pessimistic
discouraged
receptive
hungry
smirking
mischievous
naughty
absorbed
amused
incertain
expectant
inhibited
anticipating
stiff
shy
apprehensive
anticipating
restrained
secretive
eager
hungry
taunt
tight-lipped
egoistic
laughing
content
anticipating
pondering
contemplating
careful
hopeful
satisfaction
apprehensive
shy
attracted
focused
amused
encouraged
sneaky
mirth
cheerful
skepticism
contented
worried
interested
whimsical
introspective
sleazy
baffled
happy
smug
delight
repulsed
serious
abashed
mocking
secretively
serene
reserved
confused
uninterested
tickled
content
playful
satisfied
understanding
optimistic
dumb
confounded
anxious
intrest
nervous
neutral
hurt
timid
tired
afraid
challenged
pondring
thoughtful
bemused
tranquil
ornery
frightened
upbeat
good-natured
eager
fulfilled
content
content
lighthearted
content
disinterested
entertained
centered
cheerful
stoic
pleased
amused
contented
anxious
bland
displeased
misanthropic
smug
unsure
excited
indifferent
listening
artificial
amused
happy
scared
disconcerted
fearful
grim
pensive
amused
focused
neutral
pleasant
welcoming
smug
joking
provocative
shrewd
aloof
disappointed
uninterested
boring
smug
pleasant
superior
smug
smug
smirk
smug
irked
mellow
smug
devious
blase
sarcastic
serene
smug
satisfied
vengeful
benevolence
annoyed
smug
leery
pompous
cockiness
disbelief
satisfied
righteous
resigned
debauched
accepting
delighted
content
gloating
inebriated
chill
content
content
entertained
accepting
mellow
stoned
complacency
satisfied
happy
content
sneaky
pleased
contented
great
content
sly
entertained
creepy
satisfied
sated
slick
euphoric
amused
pleased
pleased
happy
aroused
surprised
prideful
specious
impertinent
satisfied
sleepy
happy
joyous
sleepy
unique
snobbish
upset
dejected
tragic
tragic
sad
dejected
discouraged
cheerless
unhappy
cruel
miserable
stung
irritated
anguish
unhappy
sad
sad
disappointed
discouraged
sad
sullen
mournful
deflated
unwell
disgruntled
displeased
obstinate
mournful
dismal
sad
disappointed
irascible
despondent
melancholy
dejected
dissatisfied
impatience
glum
disappointed
saddened
disappointed
displeased
saddened
upset
sad
pensive
sad
rejected
upset
dismal
sad
unfazed
sorrowful
despair
saddened
baffled
upset
bummed
sadness
disappointed
downtrodden
sulky
distraught
dismayed
dismal
unyielding
lousy
irritated
regret
resentment
disappointed
frown
disappointed
despondent
sorrow
pouting
joyless
dissatisfied
tragical
agitated
pessimistic
bored
bittersweet
cross
unimpressed
depressed
dejected
pessimistic
aloof
discontent
down
dejected
loathing
jilted
disgruntlement
distressed
morose
sad
grumpy
sorrowful
neutral
mournful
disappointed
dysphoric
discontent
pessimistic
rejected
displeased
desolate
petulant
grumpy
disgruntled
weary
intense
crying
dejected
tired
heavyhearted
disappointed
distrustful
joyous
timid
submissive
chagrined
anxious
optimism
bashful
happy
delude
delighted
flustered
guilty
humored
doubtfully
disbelief
expectant
hopeful
blessed
embarrassed
wistful
nervous
embarrassed
convinced
relived
cheerful
pleased
beseeching
appeasing
hopeful
delighted
attracted
friendly
hopeful
uneasy
grateful
fear
grateful
strained
happy
joyous
bemused
sorry
ruffled
grateful
tender
fear
cheerful
hopeful
questioning
overjoyed
abashed
cheery
bemused
sheepish
friendly
distressed
happy
fawning
childlike
relief
friendly
friendly
happy
cheerful
glad
bemused
sympathetic
timid
optimistic
aspiring
grimacing
hopeful
aroused
hopeful
encouraging
sympathetic
uncertainly
elated
glad
exhilarated
miffed
sullen
dubious
sorrow
discouraged
scoffing
bothered
headshake
irked
dreading
grudging
seething
suspicious
neutral
apathetic
depressed
disenchanted
bewildered
vexed
nerved
uninterested
bored
irritated
thwarted
pissed
defeated
downhearted
meek
annoyed
calculating
anger
annoyed
stubborn
scorned
begrudge
melancholy
lusting
spiteful
satisfied
sorrowful
worried
contemplative
dejected
focused
avoiding
hurt
bi
tender
sad
saturnine
cross
dejected
disappointed
confused
disappointed
neutral
determined
pondering
hesitantly
tearful
apprehensive
anxious
guilty
deflated
critical
dumbfounded
annoyed
distrustful
blue
indifferent
saddened
shyness
tired
nervous
thinking
befuddled
concerned
anxious
hesitant
hesitant
bored
distrustful
hesitant
repressed
calm
offended
disbelieving
calculating
neutral
withholding
reflective
annoyed
thinking
unimpressed
frustrated
insensitive
bothered
enraged
secretive
hushed
unimpressed
unimpressed
distressed
unsuccessful
doubtful
vindictive
hushed
stung
relentless
unsure
disappointed
resignation
uncomfortable
irked
concentrated
apprehensive
pestered
irritated
quiet
uptight
unimpressed
humbled
focused
fatigued
drained
disappointed
peeved
unimpressed
dejected
boredom
distrustful
pissed
dejected
disinterested
scornful
discontent
miffed
uncaring
peeved
blue
heavyhearted
unimpressed
unamused
cautious
laconic
weary
despair
suspicious
disillusioned
impassive
aggravated
smug
indifferent
bitter
unaffected
perplexed
cold
annoyed
vexed
despondent
shocked
horrified
threatened
aghast
surprised
appallingly
shocked
outrage
shocked
alarmed
surprised
surprise
astonished
stunned
alarmed
awestruck
surprised
shocked
mortified
awestruck
scared
shocked
stunned
awe
shocked
horrified
amazed
agape
offended
aghast
shocked
aghast
awestruck
flabbergasted
disbelief
flabbergasted
incredulous
flabbergasted
astounded
gasped
unsure
guilty
helpless
uneasy
quizical
modest
worried
cool
puzzled
confused
lighthearted
snarky
perplexed
concerned
flustered
circumspect
wounded
considering
mischievous
confused
ashamed
embarrassed
bemused
disbelief
begging
considerate
hopeful
embarrassed
accepting
biggety
uncertain
confused
relieved
pretending
unsure
unsure
pleased
anxious
curious
affectionate
mournful
dejected
dismayed
nervous
pained
daunted
sad
frightened
panicked
unruffled
humbled
desperate
petrified
sad
guilty
crushed
dreading
ill
distressed
downcast
dismayed
impish
embarrassed
powerless
alarmed
intimidated
weeping
aggrieved
downhearted
uneasy
apprehensive
touched
regretful
sad
trembling
sorrow
mopey
silent
diffident
compassion
anxiously
heartbroken
dismal
sorrow
tormented
disbelieving
empathetic
timid
disconcerted
worried
sorry
nervous
empathetic
embarrassed
anxious
halfhearted
fulfilled
hopeful
tentative
grateful
moved
loving
meek
depressed
worried
hopeful
embarrassed
unsure
uneasy
chagrined
grim
apologetic
nervous
receptive
guilty
worried
embarrassed
tense
upset
unsure
tiered
happy
content
relief
placated
apologetic
agreeable
amatory
soothed
curious
contented
relaxed
stoned
blasã©
daydreaming
provocative
relaxed
placation
affectionate
grateful
happy
aroused
bashful
mellow
wanting
alleviated
tiredly
tickled
empathy
tired
mellow
relaxed
conceited
zen
pleasurable
carefree
satisfied
gratified
content
relaxed
tired
dejected
shook
depressed
gloomy
bored
blue
melancholy
disinterested
forlorn
depressed
dejected
unimpressed
dissatisfied
despondent
disappointed
melancholy
discouraged
depressed
saddened
worried
sorrowful
dejected
dejected
defeated
sad
defeated
tired
rejected
dejected
glum
foiled
discouraged
sorrowful
grieved
blues
sad
sorry
blue
sad
worry
glum
grieving
sad
disappointed
pain
worry
unhappy
depressed
sad
forlorn
sadness
compassion
dejected
depressed
dejection
melancholic
helpless
sad
blue
crushed
sad
remorseful
sulky
miserable
regret
anguished
depressed
despondent
hurt
depressed
sorrow
unhappy
helpless
emotional
neutral
tearful
nervous
unhappy
disappointed
anger
disapproving
annoyed
hostile
determined
contempt
curious
listening
irked
irritated
irked
strained
fuming
musing
stubborn
questioning
intense
discerning
snobbish
anxious
uncertain
mad
hostile
suspicious
derogatory
plotting
withheld
displeased
waiting
displeased
preparing
unspoken
angry
conflicted
confused
pensive
incredulous
grumbling
anger
intent
focused
weary
disbelieving
unhappy
doubtful
irritated
precarious
dubious
distrustful
concerned
bored
dubious
suspecting
suspicious
cross
questioning
skeptical
confused
disinterested
distrustful
wariness
unconvinced
retaliatory
pessimistic
demanding
annoyed
leering
neutral
perplexed
questioning
befuddled
contradictory
disgusted
hesitant
aggravated
disapproving
concern
irritated
jaded
dumbfounded
shocked
intentional
astonishment
shocked
afraid
alarmed
shocked
bewildered
interest
perturbed
surprised
spooked
startled
shocked
alarmed
paranoid
deranged
focused
disbelieving
amazement
surprise
annoyed
surprised
surprised
astounded
psychotic
shocked
wonder
spooked
affronted
rejected
offended
horror
interested
offended
deered
stunned
stupefied
dismay
scared
picked-on
sorrowful
startled
worried
unsure
weary
concerned
waiting
worried
distressed
shocked
shy
disbelief
awed
distressed
curious
upset
concerned
serene
content
neutral
confused
doubter
sad
anxious
rattled
studying
concentrating
apprehensive
anguished
astonished
concerned
concerned
blue
distrust
concerned
frightened
nervous
incredulous
apathetic
crazy
startled
excited
amazed
unhinged
overjoyed
eager
intrigued
provocative
bug-eyed
enticed
excited
ecstatic
cheerful
exulted
optimistic
thrilled
excited
delighted
focused
thrilled
surprised
lustful
helpful
obsessed
excited
eager
spastic
pop-eyed
pleased
interested
excited
happy
excited
interested
elated
excited
confused
aroused
amazed
alarmed
aghast
aghast
horrified
infuriated
frightened
astonished
shocked
anxious
shocked
shock
fear
sickened
vacuous
incredulity
appalled
alarmed
disbelief
panicked
horrified
sickened
shocked
horrified
revolted
panicky
fear
spooked
dumbstruck
offended
aghast
fear
worried
stunned
shocked
stupefied
aghast
shellshocked
horrified
scared
surprised
neutral
dazed
contemplative
unconcerned
dumbfounded
willful
concentrated
interested
dismay
apathetic
hesitant
stupefied
indifferent
curious
focused
interested
bored
detached
bored
meditative
content
attentive
bored
neutral
poised
involved
serious
neutral
wondering
willing
tired
bored
neutral
calm
questioning
anxious
doubtful
unsure
kind
attentive
uneasy
irritated
distressed
upset
doubtful
wistful
bitter
tenacious
vengeful
unhappy
brooding
anger
censure
pissed
irritated
blaming
discontented
suspect
disobedient
crazed
livid
disdain
wondering
disgruntled
upset
curious
disappointed
unhappy
disappointed
offended
regretful
miffed
expecting
anticipating
sad
calculating
perturbed
anger
cross
scornful
inquisitive
apprehensive
surprised
startled
interested
passionate
expecting
questioning
nonchalant
puzzled
astonished
awed
disapproving
challenging
shock
bewilderment
incredulous
mocking
surprised
disman
facetious
surprise
awed
speculative
instructing
confused
surprised
bored
surprised
startled
alert
curiosity
confusion
startled
cheated
debate
concerned
intrigued
confusion
nonplussed
doubtful
disappointed
dejected
afflicted
suspecting
angry
wry
sadness
anguished
disappointed
irritable
cross
disquieted
displeased
questioning
offended
frustrated
indignant
discouraged
suspicious
disappointed
disgruntled
disdain
annoyed
defiant
disappointed
disconcerted
untrusting
stubborn
spiteful
intense
resentful
indignant
miffed
down
disappointed
studying
annoyed
disturbed
skeptical
earnest
satisfied
content
uptight
hoping
peaceful
harassed
happy
wary
dismayed
open
judging
concentrating
angry
weary
weary
indifferent
wary
suspicious
accomplished
concentrating
intrigued
awaiting
questioningly
unsure
placid
investigative
attentive
curious
content
doubtful
confused
neutral
curious
clueless
impartial
fixated
strained
pausing
doubting
disparaging
dubiously
vacant
high
malicious
exhausted
distrustful
contemplating
distrustful
suspicious
watchful
acute
suspicious
cunning
cautious
suspicious
questioning
suspicious
sleepy
stoned
quizzical
sly
suspicion
stoned
napping
cold-hearted
suspicious
suspicious
intrigued
sardonic
strange
contemptuous
disdain
angry
grave
doubting
suspicious
bitter
suspicious
halted
indifferent
pinched
aware
negating
greedy
serious
relaxed
expectant
intrigued
curious
bold
expectant
interested
neutral
curious
content
mistrustful
wondering
doubtful
questioning
nonplussed
content
awed
hesitant
mindful
contemplative
unsure
amused
wary
perplexed
intrigued
doubting
vigilant
worried
puzzled
attentive
steady
bored
interested
convinced
playful
satisfied
upbeat
content
gratified
playful
thankful
obliged
playful
gay
relief
expectant
encouraged
elated
welcome
happy
happy
delighted
grin
happy
joyous
happy
encouraged
tender
expectant
upbeat
cheerful
content
pleased
optimistic
calm
kindhearted
genuine
happy
contented
baffled
serene
joyous
happy
entertained
bored
troubled
hurt
sad
uneasy
defeated
disenchanted
heartbroken
broken
dissatisfied
grieved
apprehensive
astonished
disheartened
tearful
queasy
somber
skeptical
depressed
apathetic
cry
disinterested
bittersweet
surprised
saddened
somber
dispirited
sad
incapable
depressed
pessimistic
disappointed
disappointed
hurt
confused
sad
disheartened
sorrowful
mad
saddened
merry
content
disingenuous
doubt
confused
pompous
insensitive
neutral
prideful
unbothered
serious
joyful
begrudgingly
contemptuous
smug
resigned
assured
annoyed
skeptical
amusement
perplexed
apathetic
cocky
unaware
sunny
upset
taciturn
entertained
joking
judicious
sulky
discouraged
childish
thoughtful
gratified
unsure
contented
smirking
drained
neutral
flirtatious
charming
relaxed
sly
loving
smug
punk
dubious
arrogant
surly
superior
suave
smug
exasperation
smug
bored
enticed
sly
satisfied
forward
skeptical
skeptical
placid
nescient
bored
smug
sly
skeptical
judgemental
unbelieving
disbelief
pissed
sly
sarcasm
pompous
sly
defiance
suspicious
haughty
propositioning
forced
restrained
happy
cheerful
skeptical
fortunate
happy
saddened
dubious
entertained
accomplished
attentive
sympathy
confused
gratified
satisfaction
waiting
amused
cognizant
quirky
surprised
surprised
ashamed
expectant
nervous
encouraged
quizzical
open
speechless
entertained
quiet
uncertainty
aroused
unaware
stunned
giggling
driven
anticipating
disbelieving
puerile
personable
surprised
concerned
contemplative
surprised
preoccupied
contented
concerned
surprised
attentive
content
subdued
blase
frightened
curiosity
sympathetic
hopeful
scared
vexed
hesitant
bittersweet
anxious
ashamed
confused
engrossed
pensive
clueless
shy
longing
pleading
disappointed
engaged
repulsed
doubtful
condoling
disbelief
saddened
awed
neutral
anxious
waiting
contemplative
amused
happy
interested
deceptive
helpful
bemused
content
entertained
satisfied
deceivingly
conniving
skeptical
satisfied
blushing
pleased
eager
pleased
amused
content
pleased
enthusiastic
spirited
content
expectant
keen
content
amused
avid
caring
teasing
joyful
smirking
imaginative
satisfied
dumbfounded
pliant
hungry
chipper
surprised
placid
discouraged
guilty
childlike
curious
observant
unhappy
worried
fear
stoic
surprise
attentive
aloof
concerned
concerned
resigned
focused
secure
accepting
cautious
disappointment
empathetic
concerned
pensive
tired
uneasily
impersonal
hopeful
expecting
empathetic
listening
placid
empty
unsure
awaiting
concerned
somber
sad
down
shocked
wild
startled
astonished
talking
recoiling
stunned
complain
horrified
shock
shocked
awestruck
dumfounded
shock
astonishment
awestruck
scared
startled
distressed
hate
stupefaction
disbelief
screaming
passionate
threatened
stunned
aghast
stunned
flabbergasted
disgusted
panic
punitive
shocked
angry
startled
frightened
frightened
rancorous
astonishment
horrified
incredulous
fearful
distraught
waiting
recoiling
dislike
detestable
fear
stunned
frustrated
displeasure
spaced
stunned
mortified
fearful
stern
hesitant
upset
afraid
displeased
distressing
crestfallen
bleak
repugnance
perplexed
repelled
dejected
shocked
panicked
disappointed
neutral
dismayed
disquieted
dismayed
unsettled
heartbroken
uninterested
fearful
adamant
concerned
flabbergasted
unexpectant
awed
astonished
amazed
aghast
stunned
speechless
surprise
shocked
invigorated
surprised
shocked
awed
unhappy
shockingly
shocked
surprised
stunned
shock
astonishment
surprise
shocked
unbelieving
unforeseen
astonishment
dreadful
shocked
surprise
shocked
dumbfounded
aghast
stupefied
shocked
awestruck
shock
shocked
surprised
amazed
surprised
worried
preoccupied
disheartened
grumpy
grouchy
enigmatic
watching
disbelief
uneasy
stunned
explosive
grumpy
irritated
alarmed
disillusioned
disappointed
indignant
expressive
puzzled
numb
disappointment
pained
irritated
bored
impatient
disappointed
rage
uncertain
sick
disappointed
rude
stubborn
disturbed
affronted
serious
melancholy
disappointed
disappointed
discouraged
sullen
confused
judgemental
confused
bored
explain
baffled
interested
peaceful
surprised
exasperated
smug
calm
aloof
disturbed
pause
insulted
suspicious
queasy
boredom
exasperated
drugged
intrest
repelled
unaware
skeptical
distrust
skeptical
high
unimpressed
questioning
nonchalant
evaluating
avenging
belittling
smart
seductive
snooty
questioning
stunned
untrusting
upbeat
puppyish
nervous
troubled
apprehensive
secretive
secretive
bored
yearning
anxious
reticent
baffled
coy
fearful
reticent
culpable
hoping
uncommunicative
innocent
scared
interested
speechless
forbearing
anticipation
tight-lipped
mild
disapproving
playful
cool
surprised
silent
coy
satisfied
anticipating
timidness
mischievous
careful
concealed
disappointed
shy
awe
amazed
wonder
astonished
interested
stunned
musical
appalled
stupefied
appalled
stunned
stunned
terrified
bewildered
aghast
challenging
aghast
surprised
amazed
aghast
appalled
aghast
shocked
alarmed
delighted
communicative
interjecting
excited
shocked
tragic
ecstatic
startled
hopeful
amazement
stunned
animated
explain
ecstatic
shocked
surprise
hesitant
aroused
unimpressed
cheerless
fatigued
disdainful
unamused
incredulously
daydream
mellow
wary
untrusting
smart
sneaky
nonplussed
serious
tranquility
bored
perturbed
tired
calculating
condemning
snobby
disinterest
sleepy
intense
curious
unamused
pessimistic
irritated
neutral
harassed
sheepish
disapproval
dubious
annoyed
determined
displeased
skeptical
seething
detached
surprise
absorbed
surprised
clear
interested
disinterested
calculating
daydreaming
calm
inscrutable
pleasant
determined
contented
interested
passive
curious
concerned
deciding
contemplative
interest
baffled
unemotional
uncurious
fascinated
apprehensive
interested
enthralled
neutral
unbelieving
backhanded
inconspicuous
enraged
intent
wondering
absorbed
waiting
listening
fair
uncertain
appalled
shocked
amazed
surprised
spooked
surprised
shocked
awestruck
horrified
astonished
dismayed
aghast
astonished
shocked
impulsive
stunned
frustration
aroused
surprised
incredulity
shocked
shocked
shocked
shocked
explain
appalled
amazed
appalled
{}
dazed
aggressive
astounded
outed
vocal
stunned
shocked
stunned
surprised
bewildered
alarmed
coy
withholding
invested
inhibited
canny
inhibited
pensive
embarrassed
intrigued
curious
apprehensive
suppressing
sarcastic
close-mouthed
unwilling
smug
secretive
indifferently
hesitating
hungry
certain
kindhearted
annoyed
humored
confused
anticipating
interested
hesitant
curious
content
wistful
expecting
muted
anxious
careful
secretive
contemplative
withholding
musing
elated
tired
anticipatory
pleased
dumb
unaffected
apprehensive
sympathetic
occupied
indifferent
bewilderment
calm
uncaring
genial
concerned
listening
contemplative
pleading
indifferent
calm
curious
interest
questioning
consternation
wonder
addled
curious
worried
surprised
surprised
surprisingly
dismayed
mellow
complacent
drawn
dumbfounded
expecting
frightened
surprised
dull
hopeful
intent
amazed
appalled
offended
uneasy
disconcerted
shocked
furious
astonished
irritation
intentional
annoyed
irritated
displeased
flipped
shock
maddened
enraged
ireful
startled
maddened
callous
hostile
staring
angrily
angry
accusatory
incited
agitated
aghast
annoyed
galled
alarmed
aghast
infuriated
indignant
appalled
shock
agitated
mean
suspicious
sadistic
resentful
incredulous
devising
focused
agitated
mad
irate
disapproval
determined
angry
furious
mistrusting
argue
angry
unfriendly
accusatory
steamed
skeptical
ireful
serious
annoyed
angry
troubled
astonished
aggressive
provoked
suspect
provoked
infuriated
vexed
wrathful
anger
furious
disapproving
antagonized
irked
unamused
irritated
terrified
intrigued
frightened
alarmed
fearful
worried
worried
distressed
petrified
bothered
concerned
powerless
troubled
unnerved
surprised
petrified
fearful
shock
worried
shocked
worried
fearful
worried
crushed
amazed
alert
apprehensive
fearful
dismayed
worried
nerves
fretful
stunned
alarmed
fearful
worried
fearful
surprise
startled
perturbed
angered
betrayed
hostility
irked
resentful
disapproval
demanding
unhappy
defiant
yelling
contentious
upset
pissed
annoyed
disappointed
dissatisfied
unhappy
annoyance
huffy
angry
offended
scorn
irritated
mad
mad
irate
harsh
furious
upset
chafed
displeased
accusing
ireful
hurt
paranoid
angry
furious
dissatisfied
enraged
inflamed
irritated
engrossed
aggressive
questioningly
intensity
domineering
hostility
fuming
furious
aggravated
anger
investigate
irritated
stern
incensed
concentrated
irritated
unimpressed
enraged
confused
angered
murderous
serious
interested
impatient
hot
disturbed
disapproval
unamused
exasperated
anger
condescending
perplexed
angry
irritated
irritated
angry
outraged
displeased
dominating
outraged
appalled
outrage
stunned
hurt
quarrelsome
yelling
incensed
awestruck
shocked
enraged
outrage
riled
insulted
irate
disbelief
accusatory
offended
stupefied
shock
shocked
astonished
astonished
insulted
infuriated
surprise
surprise
shock
shocked
angry
astonished
appalled
shocked
dismayed
bothered
riled
aghast
thunderstruck
shocked
shocked
distant
disappointed
wary
concerned
worry
mournful
sympathetic
timid
vulnerable
worryingly
worried
shy
mournful
frightened
forlorn
perplexed
wistful
apprehension
grieving
tearful
defenseless
terrified
concerned
troubled
meek
pity
concerned
distressed
bothered
uncertain
sad
rejected
down
heartbroken
distressed
focused
hurt
wounded
shy
dejected
afraid
contrite
stunned
worrisome
fearful
empathetic
somber
worried
questioning
worried
attentive
melancholic
serious
upset
dejected
shocked
pensive
wistful
imploring
complacency
interested
worried
distressed
timid
serene
suspicious
depressed
worried
troubled
neutral
fearful
upset
suspicious
hopeless
wounded
heartbroken
clueless
concerned
concerned
unemotional
curious
lustful
malicious
amused
doubtful
considering\
mocking
chuckle
sneer
stimulated
rebellious
uplifting
pleased
conniving
flirty
interest
satisfied
doubtful
intense
testy
flirty
shady
gloating
laughing
incredulous
wary
thoughtful
smug
cunning
playful
ogling
pleased
bewildered
beguiled
confident
hotshot
dumbfounded
mocking
self-satisfied
active
mischievous
cheerful
gleeful
delighted
upbeat
decisive
awe
eager
gratified
elation
stimulated
pleased
joyous
exultant
excited
expecting
mischievous
amused
cheerful
pleasant
chipper
warm
cheery
amazed
impish
calculating
happy
content
pleased
important
smug
mirthful
glee
cheerful
devious
delighted
master
evil
joyful
intrigued
distressed
irate
displeased
sneeze
thwarted
infuriated
axed
acerbic
insensitive
appalled
unpleased
snobby
displeased
uneasy
apprehensive
agitated
irate
scornful
deadly
disapproving
unpleasant
disturbed
agressive
appalled
disgruntled
exasperated
disappointed
dismayed
repulsed
nonplussed
angry
fearing
unhappy
livid
recoiling
glazed
appalled
disgust
outraged
broken
irked
aggravated
annoyed
annoyed
rage
anger
disturbed
unappreciative
peeved
hostile
frowning
stubborn
upset
irritated
dissatisfied
maddened
decisive
glare
infuriated
waiting
dissatisfaction
mad
suspicious
nosy
perturbed
indignant
uptight
mad
despondent
arrogant
insubordinate
indignant
contempt
discomfited
fiery
displeased
anger
agitated
displeased
condemning
annoyed
disgust
appalled
aghast
foiled
baffled
repulsed
broody
incensed
flustered
worried
fearful
hateful
nervous
discerning
rejected
alarmed
shocked
hostile
repelled
frightened
angered
irked
spastic
disdainfully
disturbed
trepidation
disappointment
angry
discontent
maddened
fear
fuming
revolted
gross
boiling
stunned
frightened
irked
bleak
skeptical
wondering
contemplate
captivated
surprised
blank
restless
uncertain
tough
wishful
disdainful
pleased
interested
frustration
intense
cheerful
discerning
disengaged
curious
angry
doubting
contumacious
watchful
assertively
fanciful
sneering
intent
attentive
smug
suspicious
calculating
conflicted
neutral
disbelief
agitated
amused
analytical
calm
questioning
soft
timid
sneer
cautious
surprised
quiet
joking
antagonized
sizing
neutral
appalled
bemusement
insolent
tantalized
humored
anticipation
musing
clever
frisky
pleased
restrained
caustic
tightlipped
secretive
mute
enthusiastic
terrorizing
pensive
disdain
consternation
reticent
playful
judgemental
coy
inquisitive
reticent
agonized
quiet
suspiciously
restraint
pleased
disgruntled
skeptical
prying
suspicious
bully
questioning
wasted
bored
scoffing
incredulity
disengaged
leery
leery
doleful
disconnected
pensive
suspicious
mellow
cynical
watch
suspicious
calculating
skeptical
assessing
curious
suspicious
dozing
inebriated
concentrating
distrustful
focused
studying
tired
sore
skeptical
irked
apprehensive
intriguing
leery
cunning
attentiveness
disrespectful
self-satisfied
interested
elated
intrigued
pensive
bored
astonished
wary
pondering
glaring
unhappy
cruel
neutral
dedicated
attentive
amazed
interested
leery
pensive
interested
astounded
surprise
neutral
inquisitive
doubt
unmoved
blank
calm
interested
astounded
questioning
derisive
devious
intense
complacently
optimistic
alert
obstinate
knowledgable
amused
superior
cynical
sneering
disenchanted
flaunting
receptive
neutral
sneaky
perky
cruel
interested
devious
bewildered
fascinated
ambivalent
entertained
interested
understanding
skeptical
excited
doubtful
intrigued
surprised
nefarious
thoughtful
smirking
scoffing
sneering
swaggering
impressed
smarmy
whatever
accordant
mischievous
erotically
unconvinced
pleasing
ornery
untrusting
banal
enraged
dumbstruck
thoughtful
bewildered
conniving
anger
disgruntled
confused
strained
irate
engrossment
focused
vengeful
cold
suspicious
critical
dubious
hesitant
unbelieving
angry
stimulated
fazed
fuming
seething
brave
angered
oppositional
mad
disdain
hot
suspicious
awakened
intrigued
vicious
angry
provoked
approving
deranged
surprised
surprised
challenge
hopeful
uncertain
reproach
confounded
suspecting
irritated
timid
determined
amused
manipulative
arrogant
lying
skeptical
contemplative
amused
belittling
overwhelmed
mindful
scared
interested
calm
uncertain
content
devious
miffed
silent
pious
calculating
interested
unsure
calm
determination
intrigued
amused
weird
blank
indignant
appeased
serene
neutral
unspeaking
calculating
disbelieving
blown
conniving
sore
eager
guilty
surprised
mischievous
stirred
tense
frisky
reserved
deceiving
spiteful
closed
pranking
pensive
excited
unsure
agape
anticipation
uneasy
aroused
reticent
anxious
disconcerted
inaudible
thinking
plotting
speechless
pausing
resistent
bitter
snarky
suspicious
uncertain
nervous
surprised
contented
unbelieving
indecisive
wondering
questioning
snickering
confused
smirking
dismissive
unsure
disbelieving
open
dumbfounded
perplexed
confident
disbelief
thoughtful
melancholic
sad
dismayed
surprised
confused
dismissive
understanding
unsure
curious
uptight
uncertain
insecure
scrutinizing
worry
bummed
indifferent
jesting
beseeching
anxious
doubtful
disgusted
scorn
disgruntled
angry
miffed
disgruntled
indignant
spiteful
furious
rabid
disgust
heated
revolted
enraging
loathing
disgusted
distaste
angry
ticked
repugnant
berate
offended
cantankerous
livid
overbearing
repelled
sickened
fuming
resentful
sour
bothered
disgust
angry
disdain
sneering
mad
resentment
enraged
sneering
ornery
disgusting
angry
disgusted
mad
condescending
angry
defiance
displeased
hateful
disgust
provoked
squeamish
scoffer
enraged
repulsed
disgusted
disgust
disgust
hateful
repelled
baffled
gross
distaste
irritated
enraged
irate
disgusted
disgusted
enraged
angry
disliking
rage
disgusted
disgusted
miffed
appalled
riled
angry
disgust
provoked
viperous
furious
outraged
fearful
skittish
murderous
apprehensive
fuming
irate
explosive
enraged
savage
racked
crazed
enraged
furious
intimidated
vicious
furious
rabid
rage
angry
frustrated
berate
tormented
enraged
fury
seething
abhorred
vengeful
fuming
tempest
livid
enraged
furious
distrustful
vengeful
infuriated
furious
wrathful
excited
scandalized
aghast
enraged
enraged
outraged
ferocious
furious
bullying
delirious
surprised
shocked
floored
appalled
accusatory
nonplussed
shouting
incensed
enraged
irate
enraged
flabbergasted
enraged
gasp
hostile
monster
enraged
aggravated
infuriated
bewilderment
pissed
yelling
excitement
dismayed
aggressive
inflamed
furious
explaining
outraged
irate
mean
spiteful
abhorrent
infuriated
smoldering
furious
incensed
incensed
infuriated
furious
vengeful
mental
threatening
pained
outraged
irate
swearing
furious
vengeful
galled
angry
mad
fuming
frustration
furious
seething
seething
furious
rage
livid
pissed
infuriated
vengeful
provoked
rage
hostile
exasperate
fierce
challenging
smoldering
fun
resisting
excited
joking
giggling
disconcerted
anticipating
delighted
gleeful
eager
anticipatory
nervous
thrilled
secretive
festive
reckless
wired
satisfied
secretive
thrilled
playful
contemplative
coy
eager
cheerful
zany
happy
satisfied
happy
tease
anticipating
uncommunicative
merry
contented
excited
guilty
suppressing
aroused
impish
uncaring
sarcastic
annoyed
pausing
skeptically
disdainful
pensive
foiled
cocky
perplexed
fulfilled
frustrated
discouraged
stumped
thinking
disappointed
bland
doltish
disappointed
uptight
neutral
unaffected
displeased
quizzical
annoyed
apprehensive
disappointing
dejected
annoyed
undecided
dissatisfied
sarcastic
cheeky
questioning
skeptical
disinterested
puzzled
satisfied
dubious
unimpressed
resigned
mischievous
absorbed
confident
accepting
pondering
acceptance
thoughtful
cheerful
questioning
hopeful
hopeful
confident
cockeyed
sneaky
misgiving
scheming
cynic
rough
aroused
gratified
amused
wary
fiendish
perplexed
calm
complacent
skeptical
unsure
dysphoric
coy
aroused
sly
thrilled
teasing
interested
neutral
amused
jovial
playful
confident
excited
ecstatic
disparaging
anxious
ready
anticipating
satisfied
eager
fascinated
nervously
happy
ignorant
happy
contemplating
impish
restrained
secretive
anticipating
proud
anticipatory
joyful
confident
playful
embody
hungry
nosy
happy
apprehensive
mischievous
exploitive
playful
happy
interested
unagitated
stifled
planning
awaiting
excited
excited
maleficent
neutral
withholding
content
reluctantly
excited
secretive
disbelieving
strained
watching
petulant
secretive
sheepish
bitter
withholding
hesitant
anticipating
bemused
tempted
intense
tickled
famished
irritated
expecting
puzzled
bursting
silent
fixated
anticipating
secretive
secretive
concentrating
laughter
nervous
disagree
amused
uneasy
shameful
processing
pensive
surprised
lecherous
annoyed
insidious
inculpate
sly
skeptical
stoical
unimpressed
bored
pessimistic
detached
disbelief
unimpressed
expecting
arrogantly
unbelieving
cynical
refusing
seductive
dismissive
malevolent
skeptical
disappointed
incredulous
calm
disbelieving
cold
condescending
preoccupied
inquisitive
determined
serene
calm
dispassionate
tired
conceited
unswayed
cold
neutral
listening
startled
agog
flaming
annoyed
commanding
befuddled
disbelieving
surprised
disbelief
tired
yawn
surprisingly
appalled
rebutting
astounded
startled
bored
ragged
tired
disbelief
sarcastic
astonished
curious
aroused
surprised
faking
surprised
confrontational
burn
skeptical
stunned
awe
expressive
disbelief
aroused
surprised
hostile
yawning
mislead
dumbfounded
wary
devious
judging
disdainful
sneaky
denouncing
disinterested
irritated
hesitant
contempt
calculating
secretive
calm
neutral
pondering
perplexed
frustrated
secretive
uncommunicative
intrigued
suspiciously
concentrated
flirtatious
reticent
forceful
untrusting
plotting
doubtful
peeved
hateful
smug
deliberating
scornful
indecisive
disbelieving
fiendish
dour
concentrating
restraint
annoyed
suppression
terse
peculiar
charmed
incredulity
tranquil
awaiting
confidently
quiet
taciturn
pensive
thoughtful
annoyed
preoccupied
guilty
internalizing
wondering
repressed
irritated
immersed
shy
close-mouthed
secretive
reserved
satisfied
uninvolved
shout
anticipating
awaiting
anticipating
secretive
concentration
neutral
concentrating
anticipating
mischievous
humored
tightlipped
anticipatory
thinking
bored
irritated
misgiving
scornful
deliberate
unwilling
sneering
slow
intense
confident
drowsy
concentrated
mistrustful
tired
ignoring
tired
enamored
bored
confounded
frustrated
composed
bored
drunk
distrustful
misgiving
steely
dismissive
drowsy
disinterested
bored
conceited
diffident
fatigue
neutral
stoned
weary
serene
miffed
dissatisfied
concentrating
disbelief
murderous
hateful
mad
panic
aggravated
dismayed
pissed
angry
intent
mad
rage
irate
peeved
anger
infuriated
determined
strained
serious
incensed
riled
outrage
stressed
irritated
irate
incensed
indignant
concerned
furious
disbelief
furious
threatening
dominant
irate
numb
focused
aghast
angered
intentional
provoked
denied
disjointed
angry
angry
outraged
heated
vexed
wary
annoyed
contemptuous
frustrated
resentful
cranky
bothered
agitated
cross
heated
stubborn
accusing
agitated
scorn
outraged
revengeful
angry
angry
umbrageous
miffed
suspicious
angered
upset
angered
irritated
grim
frustrated
anger
irate
exasperated
angry
pouting
displeasure
uncertain
desperate
threatened
alarmed
afraid
fretful
terrified
shocked
shocked
frightened
wounded
startled
fearful
worried
frightened
awed
dismayed
afraid
devastated
stirred
scared
fearful
mournful
disbelief
scared
scared
heavyhearted
apprehensive
disbelief
frightened
vulnerable
terrified
white
distraught
afraid
terrified
panicked
anxious
surprised
scared
enraged
distraught
snarling
fury
furious
aggressive
biting
enraged
malice
furious
infuriated
fierce
inflamed
fiery
riotous
infuriated
anger
mad
hateful
furious
blinded
riled
infuriated
inflamed
murderous
livid
outraged
enraged
fuming
outraged
irate
enraged
enraged
hostile
menacing
raging
irate
provoked
furious
irritated
eager
blissful
happy
conceited
mocking
impish
conniving
gleeful
happy
interested
disconcerted
conniving
gleeful
reproachful
enthralled
anticipative
discontented
malicious
pleased
mischievous
mad
vindictive
smug
happy
sinisterly
dangerous
maniacal
devilish
doubtful
pleased
mocking
plotting
madness
curious
taunting
curiosity
cruel
sardonic
sly
unpleasant
plotting
sneaky
plotting
disdain
conflicted
displeased
smug
arrogant
vindictive
irritated
angered
disbelief
malicious
scornful
pessimistic
conniving
vindictive
snide
bewilderment
hatred
confused
skeptical
puzzled
determined
confused
stupefied
curious
engaged
bristling
accusing
sarcastic
concentrating
bitter
demised
plotting
smug
callous
expecting
annoyed
ruffled
stressed
pointed
challenging
satisfied
plotting
combative
misgiving
shifty
malicious
malevolant
envious
amused
devious
scheming
mischievous
sinister
dubiety
pompous
infuriated
happy
sadistic
wondering
offensive
disbelieving
conceited
mad
intrigued
devilish
skeptical
crazed
arrogant
stimulated
plotting
incredulous
confused
brave
calculating
nefarious
sinister
absorbed
enraged
discouraged
provoked
displeasure
mad
crabby
indignant
angry
defiant
agitated
inimical
argumentative
aggressive
punished
resentful
vengeful
resentful
mad
resentful
affronted
uptight
aggressive
angry
inflamed
grumpy
disappointed
resentful
sulking
serious
irritably
huffy
wrathful
expressive
irked
disapproval
infuriated
disappointed
disgruntled
upset
tempestuous
angry
bothered
furious
disruptive
enraged
rage
intent
disbelieving
puzzled
insular
skeptical
incensed
anger
pissed
angered
disbelief
testy
steeling
derisive
intense
focused
antagonistic
mad
distrusting
intent
furiously
vengeful
impatient
anger
insisting
irate
scowl
angry
rankled
angry
resentful
agitated
contemptuous
irritated
tense
irritated
discouraged
passive
focused
contrary
thoughtful
doubtful
skeptical
mad
wary
addled
confused
intense
bothered
mad
enraged
quizzical
hateful
scornful
insinuating
neutral
irritated
annoyed
suspicion
angered
confounded
concerned
negative
madness
accusatory
upset
shocked
interrogating
trusting
jealous
baffled
suspicious
wary
condescending
annoyed
resentful
misgiving
unbelieving
fighting
deplorable
anger
perplexed
frustration
stern
bewildered
serious
sore
enraged
intense
hostile
vengeful
suspicious
irritated
riled
wary
incensed
confused
shocked
annoyed
annoyed
hostile
annoyed
questioning
peeved
disturbed
insulting
defiant
cunning
skeptical
unforgiving
determined
spiteful
struck
stern
disbelieving
unforgiving
disgusted
enraged
defiant
hateful
pissed
furious
disgusted
disturbed
dismayed
irate
displeased
vexed
disdain
vexation
stern
cantankerous
rejected
furious
serious
distraught
angered
angry
snarly
raving
angry
mad
irate
disgusted
hatred
muttering
disgust
ill-tempered
dismissive
disgusted
